TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_hsadc__include
#define ti_devices_msp_peripherals_hw_hsadc__include

/* Filename: hw_hsadc.h */
/* Revised: 2025-08-26 14:25:21 */
/* Revision: a3c32839a6179063696fb41ed048889ea7fe5cb4 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* HSADC Registers
******************************************************************************/
#define HSADC_ADC_LITE_RESULT_REGS_OFS           ((uint32_t)0x00001000U)
#define HSADC_ADC_LITE_REGS_OFS                  ((uint32_t)0x00001000U)
#define HSADC_GPRCM_OFS                          ((uint32_t)0x00000800U)


/** @addtogroup HSADC_ADC_LITE_RESULT_REGS
  @{
*/

typedef struct {
  __IO uint16_t ADCRESULT0;                        /* !< (@ 0x00001000) ADC Result 0 Register */
  __IO uint16_t ADCRESULT1;                        /* !< (@ 0x00001002) ADC Result 1 Register */
  __IO uint16_t ADCRESULT2;                        /* !< (@ 0x00001004) ADC Result 2 Register */
  __IO uint16_t ADCRESULT3;                        /* !< (@ 0x00001006) ADC Result 3 Register */
  __IO uint16_t ADCRESULT4;                        /* !< (@ 0x00001008) ADC Result 4 Register */
  __IO uint16_t ADCRESULT5;                        /* !< (@ 0x0000100A) ADC Result 5 Register */
  __IO uint16_t ADCRESULT6;                        /* !< (@ 0x0000100C) ADC Result 6 Register */
  __IO uint16_t ADCRESULT7;                        /* !< (@ 0x0000100E) ADC Result 7 Register */
  __IO uint16_t ADCRESULT8;                        /* !< (@ 0x00001010) ADC Result 8 Register */
  __IO uint16_t ADCRESULT9;                        /* !< (@ 0x00001012) ADC Result 9 Register */
  __IO uint16_t ADCRESULT10;                       /* !< (@ 0x00001014) ADC Result 10 Register */
  __IO uint16_t ADCRESULT11;                       /* !< (@ 0x00001016) ADC Result 11 Register */
  __IO uint16_t ADCRESULT12;                       /* !< (@ 0x00001018) ADC Result 12 Register */
  __IO uint16_t ADCRESULT13;                       /* !< (@ 0x0000101A) ADC Result 13 Register */
  __IO uint16_t ADCRESULT14;                       /* !< (@ 0x0000101C) ADC Result 14 Register */
  __IO uint16_t ADCRESULT15;                       /* !< (@ 0x0000101E) ADC Result 15 Register */
       uint32_t RESERVED0[8];
  __IO uint32_t ADCPPB1RESULT;                     /* !< (@ 0x00001040) ADC Post Processing Block 1 Result Register */
  __IO uint32_t ADCPPB2RESULT;                     /* !< (@ 0x00001044) ADC Post Processing Block 2 Result Register */
  __IO uint32_t ADCPPB3RESULT;                     /* !< (@ 0x00001048) ADC Post Processing Block 3 Result Register */
  __IO uint32_t ADCPPB4RESULT;                     /* !< (@ 0x0000104C) ADC Post Processing Block 4 Result Register */
  __IO uint32_t ADCPPB1SUM;                        /* !< (@ 0x00001050) ADC PPB 1 Final Sum Result Register */
  __IO uint16_t ADCPPB1COUNT;                      /* !< (@ 0x00001054) ADC PPB1 Final Conversion Count Register */
       uint16_t RESERVED1;
  __IO uint32_t ADCPPB2SUM;                        /* !< (@ 0x00001058) ADC PPB 2 Final Sum Result Register */
  __IO uint16_t ADCPPB2COUNT;                      /* !< (@ 0x0000105C) ADC PPB2 Final Conversion Count Register */
       uint16_t RESERVED2;
  __IO uint32_t ADCPPB3SUM;                        /* !< (@ 0x00001060) ADC PPB 3 Final Sum Result Register */
  __IO uint16_t ADCPPB3COUNT;                      /* !< (@ 0x00001064) ADC PPB3 Final Conversion Count Register */
       uint16_t RESERVED3;
  __IO uint32_t ADCPPB4SUM;                        /* !< (@ 0x00001068) ADC PPB 4 Final Sum Result Register */
  __IO uint16_t ADCPPB4COUNT;                      /* !< (@ 0x0000106C) ADC PPB4 Final Conversion Count Register */
       uint16_t RESERVED4[41];
  __IO uint32_t ADCSEQ1FIFORESULT;                 /* !< (@ 0x000010C0) ADC Sequence 1 FIFO Result Register */
  __IO uint32_t ADCSEQ2FIFORESULT;                 /* !< (@ 0x000010C4) ADC Sequence 2 FIFO Result Register */
  __IO uint32_t ADCSEQ3FIFORESULT;                 /* !< (@ 0x000010C8) ADC Sequence 3 FIFO Result Register */
  __IO uint32_t ADCSEQ4FIFORESULT;                 /* !< (@ 0x000010CC) ADC Sequence 4 FIFO Result Register */
  __IO uint32_t ADCSEQ1FIFOSTATUS;                 /* !< (@ 0x000010D0) ADC Sequence 1 FIFO Status */
  __IO uint32_t ADCSEQ2FIFOSTATUS;                 /* !< (@ 0x000010D4) ADC Sequence 2 FIFO Status */
  __IO uint32_t ADCSEQ3FIFOSTATUS;                 /* !< (@ 0x000010D8) ADC Sequence 3 FIFO Status */
  __IO uint32_t ADCSEQ4FIFOSTATUS;                 /* !< (@ 0x000010DC) ADC Sequence 4 FIFO Status */
} HSADC_ADC_LITE_RESULT_REGS_Regs;

/*@}*/ /* end of group HSADC_ADC_LITE_RESULT_REGS */

/** @addtogroup hsadc_ADC_LITE_RESULT_REGS
  @{
*/

