TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
typedef struct {
       uint32_t RESERVED0[1024];
  HSADC_ADC_LITE_RESULT_REGS_Regs  ADC_LITE_RESULT_REGS;              /* !< (@ 0x00001000) */
} hsadc_ADC_LITE_RESULT_REGS_Regs;

/*@}*/ /* end of group hsadc_ADC_LITE_RESULT_REGS */

/** @addtogroup HSADC_ADC_LITE_REGS
  @{
*/

typedef struct {
  __IO uint32_t ADCCTL1;                           /* !< (@ 0x00001000) ADC Control 1 Register */
  __IO uint32_t ADCCTL2;                           /* !< (@ 0x00001004) ADC Control 2 Register */
       uint32_t RESERVED0;
  __IO uint32_t ADCBURSTCTL;                       /* !< (@ 0x0000100C) ADC Burst Control Register */
  __IO uint32_t ADCINTSEL;                         /* !< (@ 0x00001010) ADC Interrupt 1, 2, 3 and 4 Selection Register */
  __IO uint32_t ADCDMAINTSEL;                      /* !< (@ 0x00001014) ADC DMA Interrupt 1, 2, 3 and 4 Selection Register */
  __IO uint32_t ADCRAWINTFLG;                      /* !< (@ 0x00001018) ADC Raw Interrupt Flag Register */
  __IO uint32_t ADCINTFLG;                         /* !< (@ 0x0000101C) ADC Interrupt Flag Register */
  __IO uint32_t ADCINTFLGFRC;                      /* !< (@ 0x00001020) ADC Interrupt Flag Force Register */
  __IO uint32_t ADCINTFLGCLR;                      /* !< (@ 0x00001024) ADC Interrupt Flag Clear Register */
  __IO uint32_t ADCINTOVF;                         /* !< (@ 0x00001028) ADC Interrupt Overflow Register */
  __IO uint32_t ADCINTOVFCLR;                      /* !< (@ 0x0000102C) ADC Interrupt Overflow Clear Register */
  __IO uint32_t ADCSOCPRICTL;                      /* !< (@ 0x00001030) ADC SOC Priority Control Register */
  __IO uint32_t ADCINTSOCSEL1;                     /* !< (@ 0x00001034) ADC Interrupt SOC Selection 1 Register */
  __IO uint32_t ADCINTSOCSEL2;                     /* !< (@ 0x00001038) ADC Interrupt SOC Selection 2 Register */
  __IO uint32_t ADCSOCFLG1;                        /* !< (@ 0x0000103C) ADC SOC Flag 1 Register */
  __IO uint32_t ADCSOCFRC1;                        /* !< (@ 0x00001040) ADC SOC Force 1 Register */
  __IO uint32_t ADCSOCOVF1;                        /* !< (@ 0x00001044) ADC SOC Overflow 1 Register */
  __IO uint32_t ADCSOCOVFCLR1;                     /* !< (@ 0x00001048) ADC SOC Overflow Clear 1 Register */
  __IO uint32_t ADCSOC0CTL;                        /* !< (@ 0x0000104C) ADC SOC0 Control Register */
  __IO uint32_t ADCSOC1CTL;                        /* !< (@ 0x00001050) ADC SOC1 Control Register */
  __IO uint32_t ADCSOC2CTL;                        /* !< (@ 0x00001054) ADC SOC2 Control Register */
  __IO uint32_t ADCSOC3CTL;                        /* !< (@ 0x00001058) ADC SOC3 Control Register */
  __IO uint32_t ADCSOC4CTL;                        /* !< (@ 0x0000105C) ADC SOC4 Control Register */
  __IO uint32_t ADCSOC5CTL;                        /* !< (@ 0x00001060) ADC SOC5 Control Register */
  __IO uint32_t ADCSOC6CTL;                        /* !< (@ 0x00001064) ADC SOC6 Control Register */
  __IO uint32_t ADCSOC7CTL;                        /* !< (@ 0x00001068) ADC SOC7 Control Register */
  __IO uint32_t ADCSOC8CTL;                        /* !< (@ 0x0000106C) ADC SOC8 Control Register */
  __IO uint32_t ADCSOC9CTL;                        /* !< (@ 0x00001070) ADC SOC9 Control Register */
  __IO uint32_t ADCSOC10CTL;                       /* !< (@ 0x00001074) ADC SOC10 Control Register */
  __IO uint32_t ADCSOC11CTL;                       /* !< (@ 0x00001078) ADC SOC11 Control Register */
  __IO uint32_t ADCSOC12CTL;                       /* !< (@ 0x0000107C) ADC SOC12 Control Register */
  __IO uint32_t ADCSOC13CTL;                       /* !< (@ 0x00001080) ADC SOC13 Control Register */
  __IO uint32_t ADCSOC14CTL;                       /* !< (@ 0x00001084) ADC SOC14 Control Register */
  __IO uint32_t ADCSOC15CTL;                       /* !< (@ 0x00001088) ADC SOC15 Control Register */
       uint32_t RESERVED1[16];
  __IO uint32_t ADCEVTSTAT;                        /* !< (@ 0x000010CC) ADC Event Status Register */
  __IO uint32_t ADCEVTCLR;                         /* !< (@ 0x000010D0) ADC Event Clear Register */
  __IO uint32_t ADCEVTSEL;                         /* !< (@ 0x000010D4) ADC Event Selection Register */
  __IO uint32_t ADCEVTINTSEL;                      /* !< (@ 0x000010D8) ADC Event Interrupt Selection Register */
  __IO uint32_t ADCOSDETECT;                       /* !< (@ 0x000010DC) ADC Open and Shorts Detect Register */
       uint32_t RESERVED2;
  __IO uint32_t ADCREV;                            /* !< (@ 0x000010E4) ADC Revision Register */
  __IO uint32_t ADCOFFTRIM;                        /* !< (@ 0x000010E8) ADC Offset Trim Register 1 */
       uint32_t RESERVED3;
  __IO uint32_t ADCCONFIG;                         /* !< (@ 0x000010F0) ADC Config Register */
       uint32_t RESERVED4[3];
  __IO uint32_t ADCPPB1CONFIG;                     /* !< (@ 0x00001100) ADC PPB1 Config Register */
       uint32_t RESERVED5;
  __IO uint32_t ADCPPB1OFFCAL;                     /* !< (@ 0x00001108) ADC PPB1 Offset Calibration Register */
  __IO uint32_t ADCPPB1OFFREF;                     /* !< (@ 0x0000110C) ADC PPB1 Offset Reference Register */
  __IO uint32_t ADCPPB1TRIPHI;                     /* !< (@ 0x00001110) ADC PPB1 Trip High Register */
  __IO uint32_t ADCPPB1TRIPLO;                     /* !< (@ 0x00001114) ADC PPB1 Trip Low/Trigger Time Stamp Register */
       uint32_t RESERVED6[2];
  __IO uint32_t ADCPPB2CONFIG;                     /* !< (@ 0x00001120) ADC PPB2 Config Register */
       uint32_t RESERVED7;
  __IO uint32_t ADCPPB2OFFCAL;                     /* !< (@ 0x00001128) ADC PPB2 Offset Calibration Register */
  __IO uint32_t ADCPPB2OFFREF;                     /* !< (@ 0x0000112C) ADC PPB2 Offset Reference Register */
  __IO uint32_t ADCPPB2TRIPHI;                     /* !< (@ 0x00001130) ADC PPB2 Trip High Register */
  __IO uint32_t ADCPPB2TRIPLO;                     /* !< (@ 0x00001134) ADC PPB2 Trip Low/Trigger Time Stamp Register */
       uint32_t RESERVED8[2];
  __IO uint32_t ADCPPB3CONFIG;                     /* !< (@ 0x00001140) ADC PPB3 Config Register */
       uint32_t RESERVED9;
  __IO uint32_t ADCPPB3OFFCAL;                     /* !< (@ 0x00001148) ADC PPB3 Offset Calibration Register */
  __IO uint32_t ADCPPB3OFFREF;                     /* !< (@ 0x0000114C) ADC PPB3 Offset Reference Register */
  __IO uint32_t ADCPPB3TRIPHI;                     /* !< (@ 0x00001150) ADC PPB3 Trip High Register */
  __IO uint32_t ADCPPB3TRIPLO;                     /* !< (@ 0x00001154) ADC PPB3 Trip Low/Trigger Time Stamp Register */
       uint32_t RESERVED10[2];
  __IO uint32_t ADCPPB4CONFIG;                     /* !< (@ 0x00001160) ADC PPB4 Config Register */
       uint32_t RESERVED11;
  __IO uint32_t ADCPPB4OFFCAL;                     /* !< (@ 0x00001168) ADC PPB4 Offset Calibration Register */
  __IO uint32_t ADCPPB4OFFREF;                     /* !< (@ 0x0000116C) ADC PPB4 Offset Reference Register */
  __IO uint32_t ADCPPB4TRIPHI;                     /* !< (@ 0x00001170) ADC PPB4 Trip High Register */
  __IO uint32_t ADCPPB4TRIPLO;                     /* !< (@ 0x00001174) ADC PPB4 Trip Low/Trigger Time Stamp Register */
       uint32_t RESERVED12[2];
  __IO uint32_t ADCINTCYCLE;                       /* !< (@ 0x00001180) ADC Early Interrupt Generation Cycle */
  __IO uint32_t ADCINLTRIM1;                       /* !< (@ 0x00001184) ADC Linearity Trim 1 Register */
  __IO uint32_t ADCINLTRIM2;                       /* !< (@ 0x00001188) ADC Linearity Trim 2 Register */
  __IO uint32_t ADCINLTRIM3;                       /* !< (@ 0x0000118C) ADC Linearity Trim 3 Register */
  __IO uint32_t ADCINLTRIM4;                       /* !< (@ 0x00001190) ADC Linearity Trim 4 Register */
  __IO uint32_t ADCINLTRIM5;                       /* !< (@ 0x00001194) ADC Linearity Trim 5 Register */
  __IO uint32_t ADCINLTRIM6;                       /* !< (@ 0x00001198) ADC Linearity Trim 6 Register */
  __IO uint32_t ADCREV2;                           /* !< (@ 0x0000119C) ADC Wrapper Revision Register */
  __IO uint32_t ADCINLTRIMCTL;                     /* !< (@ 0x000011A0) ADC Linearity Trim Control Register */
       uint32_t RESERVED13[7];
  __IO uint32_t REP1CTL;                           /* !< (@ 0x000011C0) ADC Trigger Repeater 1 Control Register */
  __IO uint32_t REP1N;                             /* !< (@ 0x000011C4) ADC Trigger Repeater 1 N Select Register */
       uint32_t RESERVED14[2];
  __IO uint32_t REP1FRC;                           /* !< (@ 0x000011D0) ADC Trigger Repeater 1 Software Force Register */
       uint32_t RESERVED15[3];
  __IO uint32_t REP2CTL;                           /* !< (@ 0x000011E0) ADC Trigger Repeater 2 Control Register */
  __IO uint32_t REP2N;                             /* !< (@ 0x000011E4) ADC Trigger Repeater 2 N Select Register */
       uint32_t RESERVED16[2];
  __IO uint32_t REP2FRC;                           /* !< (@ 0x000011F0) ADC Trigger Repeater 2 Software Force Register */
       uint32_t RESERVED17[3];
  __IO uint32_t ADCPPB1LIMIT;                      /* !< (@ 0x00001200) ADC PPB1Conversion Count Limit Register */
  __IO uint32_t ADCPPB1PCOUNT;                     /* !< (@ 0x00001204) ADC PPB1 Partial Conversion Count Register */
  __IO uint32_t ADCPPB1CONFIG2;                    /* !< (@ 0x00001208) ADC PPB1 Sum Shift Register */
  __IO uint32_t ADCPPB1PSUM;                       /* !< (@ 0x0000120C) ADC PPB1 Partial Sum Register */
       uint32_t RESERVED18[12];
  __IO uint32_t ADCPPB2LIMIT;                      /* !< (@ 0x00001240) ADC PPB2Conversion Count Limit Register */
  __IO uint32_t ADCPPB2PCOUNT;                     /* !< (@ 0x00001244) ADC PPB2 Partial Conversion Count Register */
  __IO uint32_t ADCPPB2CONFIG2;                    /* !< (@ 0x00001248) ADC PPB2 Sum Shift Register */
  __IO uint32_t ADCPPB2PSUM;                       /* !< (@ 0x0000124C) ADC PPB2 Partial Sum Register */
       uint32_t RESERVED19[12];
  __IO uint32_t ADCPPB3LIMIT;                      /* !< (@ 0x00001280) ADC PPB3Conversion Count Limit Register */
  __IO uint32_t ADCPPB3PCOUNT;                     /* !< (@ 0x00001284) ADC PPB3 Partial Conversion Count Register */
  __IO uint32_t ADCPPB3CONFIG2;                    /* !< (@ 0x00001288) ADC PPB3 Sum Shift Register */
  __IO uint32_t ADCPPB3PSUM;                       /* !< (@ 0x0000128C) ADC PPB3 Partial Sum Register */
       uint32_t RESERVED20[12];
  __IO uint32_t ADCPPB4LIMIT;                      /* !< (@ 0x000012C0) ADC PPB4Conversion Count Limit Register */
  __IO uint32_t ADCPPB4PCOUNT;                     /* !< (@ 0x000012C4) ADC PPB4 Partial Conversion Count Register */
  __IO uint32_t ADCPPB4CONFIG2;                    /* !< (@ 0x000012C8) ADC PPB4 Sum Shift Register */
  __IO uint32_t ADCPPB4PSUM;                       /* !< (@ 0x000012CC) ADC PPB4 Partial Sum Register */
       uint32_t RESERVED21[15];
  __IO uint32_t DTB;                               /* !< (@ 0x0000130C) Digital Test Bus */
       uint32_t RESERVED22[4];
  __IO uint32_t ADCSEQCTL;                         /* !< (@ 0x00001320) ADC Sequencer common control Register */
  __IO uint32_t ADCSEQ1CONFIG;                     /* !< (@ 0x00001324) ADC Sequencer 1 Config register */
  __IO uint32_t ADCSEQ2CONFIG;                     /* !< (@ 0x00001328) ADC Sequencer 2 Config register */
  __IO uint32_t ADCSEQ3CONFIG;                     /* !< (@ 0x0000132C) ADC Sequencer 3 Config register */
  __IO uint32_t ADCSEQ4CONFIG;                     /* !< (@ 0x00001330) ADC Sequencer 4 Config register */
} HSADC_ADC_LITE_REGS_Regs;

/*@}*/ /* end of group HSADC_ADC_LITE_REGS */

/** @addtogroup HSADC_GPRCM
  @{
*/

