TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
       uint32_t RESERVED0[3];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} HSADC_GPRCM_Regs;

/*@}*/ /* end of group HSADC_GPRCM */

/** @addtogroup hsadc_ADC_LITE_REGS
  @{
*/

typedef struct {
       uint32_t RESERVED0[256];
  __IO uint32_t FSUB_0;                            /* !< (@ 0x00000400) Subscriber Port 0 */
  __IO uint32_t FSUB_1;                            /* !< (@ 0x00000404) Subscriber Port 1 */
  __IO uint32_t FSUB_2;                            /* !< (@ 0x00000408) Subscriber Port 2 */
  __IO uint32_t FSUB_3;                            /* !< (@ 0x0000040C) Subscriber Port 3 */
       uint32_t RESERVED1[13];
  __IO uint32_t FPUB_0;                            /* !< (@ 0x00000444) Publisher port 0 */
  __IO uint32_t FPUB_1;                            /* !< (@ 0x00000448) Publisher port 1 */
  __IO uint32_t FPUB_2;                            /* !< (@ 0x0000044C) Publisher port 2 */
  __IO uint32_t FPUB_3;                            /* !< (@ 0x00000450) Publisher port 3 */
       uint32_t RESERVED2[235];
  HSADC_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED3[506];
  HSADC_ADC_LITE_REGS_Regs  ADC_LITE_REGS;                     /* !< (@ 0x00001000) */
} hsadc_ADC_LITE_REGS_Regs;

/*@}*/ /* end of group hsadc_ADC_LITE_REGS */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* HSADC Register Control Bits
******************************************************************************/

/* HSADC_ADCRESULT0 Bits */
/* HSADC_ADCRESULT0[RESULT] Bits */
#define HSADC_ADCRESULT0_RESULT_OFS              (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT0_RESULT_MASK             ((uint16_t)0x0000FFFFU)         /* !< ADC Result 0 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC0, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT1 Bits */
/* HSADC_ADCRESULT1[RESULT] Bits */
#define HSADC_ADCRESULT1_RESULT_OFS              (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT1_RESULT_MASK             ((uint16_t)0x0000FFFFU)         /* !< ADC Result 1 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC1, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT2 Bits */
/* HSADC_ADCRESULT2[RESULT] Bits */
#define HSADC_ADCRESULT2_RESULT_OFS              (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT2_RESULT_MASK             ((uint16_t)0x0000FFFFU)         /* !< ADC Result 2 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC2, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT3 Bits */
/* HSADC_ADCRESULT3[RESULT] Bits */
#define HSADC_ADCRESULT3_RESULT_OFS              (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT3_RESULT_MASK             ((uint16_t)0x0000FFFFU)         /* !< ADC Result 3 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC3, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT4 Bits */
/* HSADC_ADCRESULT4[RESULT] Bits */
#define HSADC_ADCRESULT4_RESULT_OFS              (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT4_RESULT_MASK             ((uint16_t)0x0000FFFFU)         /* !< ADC Result 4 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC4, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT5 Bits */
/* HSADC_ADCRESULT5[RESULT] Bits */
#define HSADC_ADCRESULT5_RESULT_OFS              (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT5_RESULT_MASK             ((uint16_t)0x0000FFFFU)         /* !< ADC Result 5 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC5, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

