TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCRESULT6 Bits */
/* HSADC_ADCRESULT6[RESULT] Bits */
#define HSADC_ADCRESULT6_RESULT_OFS              (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT6_RESULT_MASK             ((uint16_t)0x0000FFFFU)         /* !< ADC Result 6 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC6, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT7 Bits */
/* HSADC_ADCRESULT7[RESULT] Bits */
#define HSADC_ADCRESULT7_RESULT_OFS              (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT7_RESULT_MASK             ((uint16_t)0x0000FFFFU)         /* !< ADC Result 7 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC7, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT8 Bits */
/* HSADC_ADCRESULT8[RESULT] Bits */
#define HSADC_ADCRESULT8_RESULT_OFS              (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT8_RESULT_MASK             ((uint16_t)0x0000FFFFU)         /* !< ADC Result 8 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC8, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT9 Bits */
/* HSADC_ADCRESULT9[RESULT] Bits */
#define HSADC_ADCRESULT9_RESULT_OFS              (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT9_RESULT_MASK             ((uint16_t)0x0000FFFFU)         /* !< ADC Result 9 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC9, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT10 Bits */
/* HSADC_ADCRESULT10[RESULT] Bits */
#define HSADC_ADCRESULT10_RESULT_OFS             (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT10_RESULT_MASK            ((uint16_t)0x0000FFFFU)         /* !< ADC Result 10 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC10, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT11 Bits */
/* HSADC_ADCRESULT11[RESULT] Bits */
#define HSADC_ADCRESULT11_RESULT_OFS             (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT11_RESULT_MASK            ((uint16_t)0x0000FFFFU)         /* !< ADC Result 11 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC11, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT12 Bits */
/* HSADC_ADCRESULT12[RESULT] Bits */
#define HSADC_ADCRESULT12_RESULT_OFS             (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT12_RESULT_MASK            ((uint16_t)0x0000FFFFU)         /* !< ADC Result 12 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC12, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

/* HSADC_ADCRESULT13 Bits */
/* HSADC_ADCRESULT13[RESULT] Bits */
#define HSADC_ADCRESULT13_RESULT_OFS             (0)                             /* !< RESULT Offset */
#define HSADC_ADCRESULT13_RESULT_MASK            ((uint16_t)0x0000FFFFU)         /* !< ADC Result 13 #br# #br#12-bit ADC
                                                                                    result. After the ADC completes a
                                                                                    conversion of SOC13, the digital
                                                                                    result is placed in this bit field.
                                                                                    #br#If oversampling is enabled, Final
                                                                                    SUM (After any Shift if enabled) will
                                                                                    be stored in this register after
                                                                                    completing the specified number of
                                                                                    samples. */

