TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB1COUNT Bits */
/* HSADC_ADCPPB1COUNT[COUNT] Bits */
#define HSADC_ADCPPB1COUNT_COUNT_OFS             (0)                             /* !< COUNT Offset */
#define HSADC_ADCPPB1COUNT_COUNT_MASK            ((uint16_t)0x0000000FU)         /* !< Post Processing Block 1
                                                                                    Oversampling Final Count. When either
                                                                                    a count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB1 receives a sync.
                                                                                    event, the value of PCOUNT is loaded
                                                                                    into this register. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB1RESULT is
                                                                                    available (only in case of a
                                                                                    count-match event). This will be 2
                                                                                    SYSCLK cycles after the associated
                                                                                    ADCRESULT is available, unless
                                                                                    multiple PPBs point to the same SOC
                                                                                    (refer to the ADCPPB1RESULT timing
                                                                                    information). */

/* HSADC_ADCPPB2SUM Bits */
/* HSADC_ADCPPB2SUM[SUM] Bits */
#define HSADC_ADCPPB2SUM_SUM_OFS                 (0)                             /* !< SUM Offset */
#define HSADC_ADCPPB2SUM_SUM_MASK                ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 2
                                                                                    Oversampling Final Sum. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB2 receives a sync.
                                                                                    event, the value of PSUM is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the sum loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#The value from PSUM will be
                                                                                    right shifted by the amount specified
                                                                                    in the SHIFT register before being
                                                                                    loaded into the final SUM result
                                                                                    register. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB2RESULT is available
                                                                                    (only in case of a count-match
                                                                                    event). This will be 2 SYSCLK cycles
                                                                                    after the associated ADCRESULT is
                                                                                    available, unless multiple PPBs point
                                                                                    to the same SOC (refer to the
                                                                                    ADCPPB2RESULT timing information). */
/* HSADC_ADCPPB2SUM[SIGN] Bits */
#define HSADC_ADCPPB2SUM_SIGN_OFS                (16)                            /* !< SIGN Offset */
#define HSADC_ADCPPB2SUM_SIGN_MASK               ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC_ADCPPB2COUNT Bits */
/* HSADC_ADCPPB2COUNT[COUNT] Bits */
#define HSADC_ADCPPB2COUNT_COUNT_OFS             (0)                             /* !< COUNT Offset */
#define HSADC_ADCPPB2COUNT_COUNT_MASK            ((uint16_t)0x0000000FU)         /* !< Post Processing Block 2
                                                                                    Oversampling Final Count. When either
                                                                                    a count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB2 receives a sync.
                                                                                    event, the value of PCOUNT is loaded
                                                                                    into this register. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB2RESULT is
                                                                                    available (only in case of a
                                                                                    count-match event). This will be 2
                                                                                    SYSCLK cycles after the associated
                                                                                    ADCRESULT is available, unless
                                                                                    multiple PPBs point to the same SOC
                                                                                    (refer to the ADCPPB2RESULT timing
                                                                                    information). */

