TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB3SUM Bits */
/* HSADC_ADCPPB3SUM[SUM] Bits */
#define HSADC_ADCPPB3SUM_SUM_OFS                 (0)                             /* !< SUM Offset */
#define HSADC_ADCPPB3SUM_SUM_MASK                ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 3
                                                                                    Oversampling Final Sum. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB3 receives a sync.
                                                                                    event, the value of PSUM is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the sum loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#The value from PSUM will be
                                                                                    right shifted by the amount specified
                                                                                    in the SHIFT register before being
                                                                                    loaded into the final SUM result
                                                                                    register. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB3RESULT is available
                                                                                    (only in case of a count-match
                                                                                    event). This will be 2 SYSCLK cycles
                                                                                    after the associated ADCRESULT is
                                                                                    available, unless multiple PPBs point
                                                                                    to the same SOC (refer to the
                                                                                    ADCPPB3RESULT timing information). */
/* HSADC_ADCPPB3SUM[SIGN] Bits */
#define HSADC_ADCPPB3SUM_SIGN_OFS                (16)                            /* !< SIGN Offset */
#define HSADC_ADCPPB3SUM_SIGN_MASK               ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC_ADCPPB3COUNT Bits */
/* HSADC_ADCPPB3COUNT[COUNT] Bits */
#define HSADC_ADCPPB3COUNT_COUNT_OFS             (0)                             /* !< COUNT Offset */
#define HSADC_ADCPPB3COUNT_COUNT_MASK            ((uint16_t)0x0000000FU)         /* !< Post Processing Block 3
                                                                                    Oversampling Final Count. When either
                                                                                    a count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB3 receives a sync.
                                                                                    event, the value of PCOUNT is loaded
                                                                                    into this register. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB3RESULT is
                                                                                    available (only in case of a
                                                                                    count-match event). This will be 2
                                                                                    SYSCLK cycles after the associated
                                                                                    ADCRESULT is available, unless
                                                                                    multiple PPBs point to the same SOC
                                                                                    (refer to the ADCPPB3RESULT timing
                                                                                    information). */

/* HSADC_ADCPPB4SUM Bits */
/* HSADC_ADCPPB4SUM[SUM] Bits */
#define HSADC_ADCPPB4SUM_SUM_OFS                 (0)                             /* !< SUM Offset */
#define HSADC_ADCPPB4SUM_SUM_MASK                ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Sum. When either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB4 receives a sync.
                                                                                    event, the value of PSUM is loaded
                                                                                    into this register.  In the case of a
                                                                                    count-match event, the sum loaded
                                                                                    into this register includes the value
                                                                                    from the most recent conversion.
                                                                                    #br# #br#The value from PSUM will be
                                                                                    right shifted by the amount specified
                                                                                    in the SHIFT register before being
                                                                                    loaded into the final SUM result
                                                                                    register. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB4RESULT is available
                                                                                    (only in case of a count-match
                                                                                    event). This will be 2 SYSCLK cycles
                                                                                    after the associated ADCRESULT is
                                                                                    available, unless multiple PPBs point
                                                                                    to the same SOC (refer to the
                                                                                    ADCPPB4RESULT timing information). */
/* HSADC_ADCPPB4SUM[SIGN] Bits */
#define HSADC_ADCPPB4SUM_SIGN_OFS                (16)                            /* !< SIGN Offset */
#define HSADC_ADCPPB4SUM_SIGN_MASK               ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC_ADCPPB4COUNT Bits */
/* HSADC_ADCPPB4COUNT[COUNT] Bits */
#define HSADC_ADCPPB4COUNT_COUNT_OFS             (0)                             /* !< COUNT Offset */
#define HSADC_ADCPPB4COUNT_COUNT_MASK            ((uint16_t)0x0000000FU)         /* !< Post Processing Block 4
                                                                                    Oversampling Final Count. When either
                                                                                    a count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB4 receives a sync.
                                                                                    event, the value of PCOUNT is loaded
                                                                                    into this register. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB4RESULT is
                                                                                    available (only in case of a
                                                                                    count-match event). This will be 2
                                                                                    SYSCLK cycles after the associated
                                                                                    ADCRESULT is available, unless
                                                                                    multiple PPBs point to the same SOC
                                                                                    (refer to the ADCPPB4RESULT timing
                                                                                    information). */

/* HSADC_ADCSEQ1FIFORESULT Bits */
/* HSADC_ADCSEQ1FIFORESULT[SEQFIFORESULT] Bits */
#define HSADC_ADCSEQ1FIFORESULT_SEQFIFORESULT_OFS (0)                             /* !< SEQFIFORESULT Offset */
#define HSADC_ADCSEQ1FIFORESULT_SEQFIFORESULT_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Sequencer 1 Result in FIFO mode */

/* HSADC_ADCSEQ2FIFORESULT Bits */
/* HSADC_ADCSEQ2FIFORESULT[SEQFIFORESULT] Bits */
#define HSADC_ADCSEQ2FIFORESULT_SEQFIFORESULT_OFS (0)                             /* !< SEQFIFORESULT Offset */
#define HSADC_ADCSEQ2FIFORESULT_SEQFIFORESULT_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Sequencer 2 Result in FIFO mode */

/* HSADC_ADCSEQ3FIFORESULT Bits */
/* HSADC_ADCSEQ3FIFORESULT[SEQFIFORESULT] Bits */
#define HSADC_ADCSEQ3FIFORESULT_SEQFIFORESULT_OFS (0)                             /* !< SEQFIFORESULT Offset */
#define HSADC_ADCSEQ3FIFORESULT_SEQFIFORESULT_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Sequencer 3 Result in FIFO mode */

/* HSADC_ADCSEQ4FIFORESULT Bits */
/* HSADC_ADCSEQ4FIFORESULT[SEQFIFORESULT] Bits */
#define HSADC_ADCSEQ4FIFORESULT_SEQFIFORESULT_OFS (0)                             /* !< SEQFIFORESULT Offset */
#define HSADC_ADCSEQ4FIFORESULT_SEQFIFORESULT_MASK ((uint32_t)0xFFFFFFFFU)         /* !< Sequencer 4 Result in FIFO mode */

/* HSADC_ADCSEQ1FIFOSTATUS Bits */
/* HSADC_ADCSEQ1FIFOSTATUS[SEQFIFOVALID] Bits */
#define HSADC_ADCSEQ1FIFOSTATUS_SEQFIFOVALID_OFS (0)                             /* !< SEQFIFOVALID Offset */
#define HSADC_ADCSEQ1FIFOSTATUS_SEQFIFOVALID_MASK ((uint32_t)0x00000001U)         /* !< Sequencer 1 FIFO Valid #br#0 -  All
                                                                                    Conversions associated with the
                                                                                    current Sequencer are NOT complete.
                                                                                    #br#1 - Conversion from all the SOCs
                                                                                    associated with the Sequencer are
                                                                                    complete and result is available to
                                                                                    be read. */
/* HSADC_ADCSEQ1FIFOSTATUS[SEQFIFOPENDREAD] Bits */
#define HSADC_ADCSEQ1FIFOSTATUS_SEQFIFOPENDREAD_OFS (1)                             /* !< SEQFIFOPENDREAD Offset */
#define HSADC_ADCSEQ1FIFOSTATUS_SEQFIFOPENDREAD_MASK ((uint32_t)0x0000001EU)         /* !< Sequencer 1 FIFO pending reads
                                                                                    #br#Note:  #br#1. This field is only
                                                                                    updated when after the last byte of
                                                                                    ADCSEQ1FIFORESULT is read. #br#2. The
                                                                                    Pending read information will not be
                                                                                    updated for debug reads.  #br#3. Once
                                                                                    all the data in the FIFO has been
                                                                                    read, FIFO will wrap back. Subsequent
                                                                                    reads will read from the beginning of
                                                                                    the FIFO. */

/* HSADC_ADCSEQ2FIFOSTATUS Bits */
/* HSADC_ADCSEQ2FIFOSTATUS[SEQFIFOVALID] Bits */
#define HSADC_ADCSEQ2FIFOSTATUS_SEQFIFOVALID_OFS (0)                             /* !< SEQFIFOVALID Offset */
#define HSADC_ADCSEQ2FIFOSTATUS_SEQFIFOVALID_MASK ((uint32_t)0x00000001U)         /* !< Sequencer 2 FIFO Valid #br#0 -  All
                                                                                    Conversions associated with the
                                                                                    current Sequencer are NOT complete.
                                                                                    #br#1 - Conversion from all the SOCs
                                                                                    associated with the Sequencer are
                                                                                    complete and result is available to
                                                                                    be read. */
/* HSADC_ADCSEQ2FIFOSTATUS[SEQFIFOPENDREAD] Bits */
#define HSADC_ADCSEQ2FIFOSTATUS_SEQFIFOPENDREAD_OFS (1)                             /* !< SEQFIFOPENDREAD Offset */
#define HSADC_ADCSEQ2FIFOSTATUS_SEQFIFOPENDREAD_MASK ((uint32_t)0x0000001EU)         /* !< Sequencer 2 FIFO pending reads
                                                                                    #br#Note:  #br#1. This field is only
                                                                                    updated when after the last byte of
                                                                                    ADCSEQ2FIFORESULT is read. #br#2. The
                                                                                    Pending read information will not be
                                                                                    updated for debug reads.  #br#3. Once
                                                                                    all the data in the FIFO has been
                                                                                    read, FIFO will wrap back. Subsequent
                                                                                    reads will read from the beginning of
                                                                                    the FIFO. */

/* HSADC_ADCSEQ3FIFOSTATUS Bits */
/* HSADC_ADCSEQ3FIFOSTATUS[SEQFIFOVALID] Bits */
#define HSADC_ADCSEQ3FIFOSTATUS_SEQFIFOVALID_OFS (0)                             /* !< SEQFIFOVALID Offset */
#define HSADC_ADCSEQ3FIFOSTATUS_SEQFIFOVALID_MASK ((uint32_t)0x00000001U)         /* !< Sequencer 3 FIFO Valid #br#0 -  All
                                                                                    Conversions associated with the
                                                                                    current Sequencer are NOT complete.
                                                                                    #br#1 - Conversion from all the SOCs
                                                                                    associated with the Sequencer are
                                                                                    complete and result is available to
                                                                                    be read. */
/* HSADC_ADCSEQ3FIFOSTATUS[SEQFIFOPENDREAD] Bits */
#define HSADC_ADCSEQ3FIFOSTATUS_SEQFIFOPENDREAD_OFS (1)                             /* !< SEQFIFOPENDREAD Offset */
#define HSADC_ADCSEQ3FIFOSTATUS_SEQFIFOPENDREAD_MASK ((uint32_t)0x0000001EU)         /* !< Sequencer 3 FIFO pending reads
                                                                                    #br#Note:  #br#1. This field is only
                                                                                    updated when after the last byte of
                                                                                    ADCSEQ3FIFORESULT is read. #br#2. The
                                                                                    Pending read information will not be
                                                                                    updated for debug reads.  #br#3. Once
                                                                                    all the data in the FIFO has been
                                                                                    read, FIFO will wrap back. Subsequent
                                                                                    reads will read from the beginning of
                                                                                    the FIFO. */

