TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCINTSEL Bits */
/* HSADC_ADCINTSEL[INT1SEL] Bits */
#define HSADC_ADCINTSEL_INT1SEL_OFS              (0)                             /* !< INT1SEL Offset */
#define HSADC_ADCINTSEL_INT1SEL_MASK             ((uint32_t)0x0000000FU)         /* !< ADCINT1 EOC Source Select #br#  00h
                                                                                    EOC0 is trigger for ADCINT1 #br#
                                                                                    01h  EOC1 is trigger for ADCINT1 #br#
                                                                                    02h  EOC2 is trigger for ADCINT1
                                                                                    #br#  03h  EOC3 is trigger for
                                                                                    ADCINT1 #br#  04h  EOC4 is trigger
                                                                                    for ADCINT1 #br#  05h  EOC5 is
                                                                                    trigger for ADCINT1 #br#  06h  EOC6
                                                                                    is trigger for ADCINT1 #br#  07h
                                                                                    EOC7 is trigger for ADCINT1 #br#  08h
                                                                                    EOC8 is trigger for ADCINT1 #br#
                                                                                    09h  EOC9 is trigger for ADCINT1 #br#
                                                                                    0Ah  EOC10 is trigger for ADCINT1
                                                                                    #br#  0Bh  EOC11 is trigger for
                                                                                    ADCINT1 #br#  0Ch  EOC12 is trigger
                                                                                    for ADCINT1 #br#  0Dh  EOC13 is
                                                                                    trigger for ADCINT1 #br#  0Eh  EOC14
                                                                                    is trigger for ADCINT1 #br#  0Fh
                                                                                    EOC15 is trigger for ADCINT1 #br#
                                                                                    #br#Note : When oversampling is
                                                                                    enabled, the end of the last
                                                                                    oversampled coversion will trigger
                                                                                    the interrupts #br# */
/* HSADC_ADCINTSEL[INT1CONT] Bits */
#define HSADC_ADCINTSEL_INT1CONT_OFS             (6)                             /* !< INT1CONT Offset */
#define HSADC_ADCINTSEL_INT1CONT_MASK            ((uint32_t)0x00000040U)         /* !< ADCINT1 Continue to Interrupt Mode
                                                                                    #br#  0  No further ADCINT1 pulses
                                                                                    are generated until ADCINT1 flag (in
                                                                                    ADCINTFLG register) is cleared by
                                                                                    user. #br#  1  ADCINT1 pulses are
                                                                                    generated whenever an EOC pulse is
                                                                                    generated irrespective of whether the
                                                                                    flag bit is cleared or not. */
/* HSADC_ADCINTSEL[INT1E] Bits */
#define HSADC_ADCINTSEL_INT1E_OFS                (7)                             /* !< INT1E Offset */
#define HSADC_ADCINTSEL_INT1E_MASK               ((uint32_t)0x00000080U)         /* !< ADCINT1 Interrupt Enable #br#  0
                                                                                    ADCINT1 is disabled #br#  1  ADCINT1
                                                                                    is enabled */
/* HSADC_ADCINTSEL[INT2SEL] Bits */
#define HSADC_ADCINTSEL_INT2SEL_OFS              (8)                             /* !< INT2SEL Offset */
#define HSADC_ADCINTSEL_INT2SEL_MASK             ((uint32_t)0x00000F00U)         /* !< ADCINT2 EOC Source Select #br#  00h
                                                                                    EOC0 is trigger for ADCINT2 #br#
                                                                                    01h  EOC1 is trigger for ADCINT2 #br#
                                                                                    02h  EOC2 is trigger for ADCINT2
                                                                                    #br#  03h  EOC3 is trigger for
                                                                                    ADCINT2 #br#  04h  EOC4 is trigger
                                                                                    for ADCINT2 #br#  05h  EOC5 is
                                                                                    trigger for ADCINT2 #br#  06h  EOC6
                                                                                    is trigger for ADCINT2 #br#  07h
                                                                                    EOC7 is trigger for ADCINT2 #br#  08h
                                                                                    EOC8 is trigger for ADCINT2 #br#
                                                                                    09h  EOC9 is trigger for ADCINT2 #br#
                                                                                    0Ah  EOC10 is trigger for ADCINT2
                                                                                    #br#  0Bh  EOC11 is trigger for
                                                                                    ADCINT2 #br#  0Ch  EOC12 is trigger
                                                                                    for ADCINT2 #br#  0Dh  EOC13 is
                                                                                    trigger for ADCINT2 #br#  0Eh  EOC14
                                                                                    is trigger for ADCINT2 #br#  0Fh
                                                                                    EOC15 is trigger for ADCINT2 #br#
                                                                                    #br#Note : When oversampling is
                                                                                    enabled, the end of the last
                                                                                    oversampled coversion will trigger
                                                                                    the interrupts #br# */
/* HSADC_ADCINTSEL[INT2CONT] Bits */
#define HSADC_ADCINTSEL_INT2CONT_OFS             (14)                            /* !< INT2CONT Offset */
#define HSADC_ADCINTSEL_INT2CONT_MASK            ((uint32_t)0x00004000U)         /* !< ADCINT2 Continue to Interrupt Mode
                                                                                    #br#  0  No further ADCINT2 pulses
                                                                                    are generated until ADCINT2 flag (in
                                                                                    ADCINTFLG register) is cleared by
                                                                                    user. #br#  1  ADCINT2 pulses are
                                                                                    generated whenever an EOC pulse is
                                                                                    generated irrespective of whether the
                                                                                    flag bit is cleared or not. */
/* HSADC_ADCINTSEL[INT2E] Bits */
#define HSADC_ADCINTSEL_INT2E_OFS                (15)                            /* !< INT2E Offset */
#define HSADC_ADCINTSEL_INT2E_MASK               ((uint32_t)0x00008000U)         /* !< ADCINT2 Interrupt Enable #br#  0
                                                                                    ADCINT2 is disabled #br#  1  ADCINT2
                                                                                    is enabled */
/* HSADC_ADCINTSEL[INT3SEL] Bits */
#define HSADC_ADCINTSEL_INT3SEL_OFS              (16)                            /* !< INT3SEL Offset */
#define HSADC_ADCINTSEL_INT3SEL_MASK             ((uint32_t)0x000F0000U)         /* !< ADCINT3 EOC Source Select #br#  00h
                                                                                    EOC0 is trigger for ADCINT3 #br#
                                                                                    01h  EOC1 is trigger for ADCINT3 #br#
                                                                                    02h  EOC2 is trigger for ADCINT3
                                                                                    #br#  03h  EOC3 is trigger for
                                                                                    ADCINT3 #br#  04h  EOC4 is trigger
                                                                                    for ADCINT3 #br#  05h  EOC5 is
                                                                                    trigger for ADCINT3 #br#  06h  EOC6
                                                                                    is trigger for ADCINT3 #br#  07h
                                                                                    EOC7 is trigger for ADCINT3 #br#  08h
                                                                                    EOC8 is trigger for ADCINT3 #br#
                                                                                    09h  EOC9 is trigger for ADCINT3 #br#
                                                                                    0Ah  EOC10 is trigger for ADCINT3
                                                                                    #br#  0Bh  EOC11 is trigger for
                                                                                    ADCINT3 #br#  0Ch  EOC12 is trigger
                                                                                    for ADCINT3 #br#  0Dh  EOC13 is
                                                                                    trigger for ADCINT3 #br#  0Eh  EOC14
                                                                                    is trigger for ADCINT3 #br#  0Fh
                                                                                    EOC15 is trigger for ADCINT3 #br#
                                                                                    #br#Note : When oversampling is
                                                                                    enabled, the end of the last
                                                                                    oversampled coversion will trigger
                                                                                    the interrupts #br# */
/* HSADC_ADCINTSEL[INT3CONT] Bits */
#define HSADC_ADCINTSEL_INT3CONT_OFS             (22)                            /* !< INT3CONT Offset */
#define HSADC_ADCINTSEL_INT3CONT_MASK            ((uint32_t)0x00400000U)         /* !< ADCINT3 Continue to Interrupt Mode
                                                                                    #br#  0  No further ADCINT3 pulses
                                                                                    are generated until ADCINT3 flag (in
                                                                                    ADCINTFLG register) is cleared by
                                                                                    user. #br#  1  ADCINT3 pulses are
                                                                                    generated whenever an EOC pulse is
                                                                                    generated irrespective of whether the
                                                                                    flag bit is cleared or not. */
/* HSADC_ADCINTSEL[INT3E] Bits */
#define HSADC_ADCINTSEL_INT3E_OFS                (23)                            /* !< INT3E Offset */
#define HSADC_ADCINTSEL_INT3E_MASK               ((uint32_t)0x00800000U)         /* !< ADCINT3 Interrupt Enable #br#  0
                                                                                    ADCINT3 is disabled #br#  1  ADCINT3
                                                                                    is enabled */
/* HSADC_ADCINTSEL[INT4SEL] Bits */
#define HSADC_ADCINTSEL_INT4SEL_OFS              (24)                            /* !< INT4SEL Offset */
#define HSADC_ADCINTSEL_INT4SEL_MASK             ((uint32_t)0x0F000000U)         /* !< ADCINT4 EOC Source Select #br#  00h
                                                                                    EOC0 is trigger for ADCINT4 #br#
                                                                                    01h  EOC1 is trigger for ADCINT4 #br#
                                                                                    02h  EOC2 is trigger for ADCINT4
                                                                                    #br#  03h  EOC3 is trigger for
                                                                                    ADCINT4 #br#  04h  EOC4 is trigger
                                                                                    for ADCINT4 #br#  05h  EOC5 is
                                                                                    trigger for ADCINT4 #br#  06h  EOC6
                                                                                    is trigger for ADCINT4 #br#  07h
                                                                                    EOC7 is trigger for ADCINT4 #br#  08h
                                                                                    EOC8 is trigger for ADCINT4 #br#
                                                                                    09h  EOC9 is trigger for ADCINT4 #br#
                                                                                    0Ah  EOC10 is trigger for ADCINT4
                                                                                    #br#  0Bh  EOC11 is trigger for
                                                                                    ADCINT4 #br#  0Ch  EOC12 is trigger
                                                                                    for ADCINT4 #br#  0Dh  EOC13 is
                                                                                    trigger for ADCINT4 #br#  0Eh  EOC14
                                                                                    is trigger for ADCINT4 #br#  0Fh
                                                                                    EOC15 is trigger for ADCINT4 #br#
                                                                                    #br#Note : When oversampling is
                                                                                    enabled, the end of the last
                                                                                    oversampled coversion will trigger
                                                                                    the interrupts #br# */
/* HSADC_ADCINTSEL[INT4CONT] Bits */
#define HSADC_ADCINTSEL_INT4CONT_OFS             (30)                            /* !< INT4CONT Offset */
#define HSADC_ADCINTSEL_INT4CONT_MASK            ((uint32_t)0x40000000U)         /* !< ADCINT4 Continue to Interrupt Mode
                                                                                    #br#  0  No further ADCINT4 pulses
                                                                                    are generated until ADCINT4 flag (in
                                                                                    ADCINTFLG register) is cleared by
                                                                                    user. #br#  1  ADCINT4 pulses are
                                                                                    generated whenever an EOC pulse is
                                                                                    generated irrespective of whether the
                                                                                    flag bit is cleared or not. */
/* HSADC_ADCINTSEL[INT4E] Bits */
#define HSADC_ADCINTSEL_INT4E_OFS                (31)                            /* !< INT4E Offset */
#define HSADC_ADCINTSEL_INT4E_MASK               ((uint32_t)0x80000000U)         /* !< ADCINT4 Interrupt Enable #br#  0
                                                                                    ADCINT4 is disabled #br#  1  ADCINT4
                                                                                    is enabled */

