TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCDMAINTSEL Bits */
/* HSADC_ADCDMAINTSEL[DMAINT1SEL] Bits */
#define HSADC_ADCDMAINTSEL_DMAINT1SEL_OFS        (0)                             /* !< DMAINT1SEL Offset */
#define HSADC_ADCDMAINTSEL_DMAINT1SEL_MASK       ((uint32_t)0x0000000FU)         /* !< ADCDMAINT1 EOC Source Select #br#
                                                                                    00h  EOC0 is trigger for ADCDMAINT1
                                                                                    #br#  01h  EOC1 is trigger for
                                                                                    ADCDMAINT1 #br#  02h  EOC2 is trigger
                                                                                    for ADCDMAINT1 #br#  03h  EOC3 is
                                                                                    trigger for ADCDMAINT1 #br#  04h
                                                                                    EOC4 is trigger for ADCDMAINT1 #br#
                                                                                    05h  EOC5 is trigger for ADCDMAINT1
                                                                                    #br#  06h  EOC6 is trigger for
                                                                                    ADCDMAINT1 #br#  07h  EOC7 is trigger
                                                                                    for ADCDMAINT1 #br#  08h  EOC8 is
                                                                                    trigger for ADCDMAINT1 #br#  09h
                                                                                    EOC9 is trigger for ADCDMAINT1 #br#
                                                                                    0Ah  EOC10 is trigger for ADCDMAINT1
                                                                                    #br#  0Bh  EOC11 is trigger for
                                                                                    ADCDMAINT1 #br#  0Ch  EOC12 is
                                                                                    trigger for ADCDMAINT1 #br#  0Dh
                                                                                    EOC13 is trigger for ADCDMAINT1 #br#
                                                                                    0Eh  EOC14 is trigger for ADCDMAINT1
                                                                                    #br#  0Fh  EOC15 is trigger for
                                                                                    ADCDMAINT1 #br# #br#Note : When
                                                                                    oversampling is enabled, the end of
                                                                                    the last oversampled conversion will
                                                                                    trigger the DMAINTerrupts #br# */
/* HSADC_ADCDMAINTSEL[DMAINT1CONT] Bits */
#define HSADC_ADCDMAINTSEL_DMAINT1CONT_OFS       (6)                             /* !< DMAINT1CONT Offset */
#define HSADC_ADCDMAINTSEL_DMAINT1CONT_MASK      ((uint32_t)0x00000040U)         /* !< ADCDMAINT1 Continue to Interrupt
                                                                                    Mode #br#  0  No further ADCDMAINT1
                                                                                    pulses are generated until ADCDMAINT1
                                                                                    flag (in ADCDMAINTFLG register) is
                                                                                    cleared by user. #br#  1  ADCDMAINT1
                                                                                    pulses are generated whenever an EOC
                                                                                    pulse is generated irrespective of
                                                                                    whether the flag bit is cleared or
                                                                                    not. */
/* HSADC_ADCDMAINTSEL[DMAINT1E] Bits */
#define HSADC_ADCDMAINTSEL_DMAINT1E_OFS          (7)                             /* !< DMAINT1E Offset */
#define HSADC_ADCDMAINTSEL_DMAINT1E_MASK         ((uint32_t)0x00000080U)         /* !< ADCDMAINT1 Interrupt Enable #br#  0
                                                                                    ADCDMAINT1 is disabled #br#  1
                                                                                    ADCDMAINT1 is enabled */
/* HSADC_ADCDMAINTSEL[DMAINT2SEL] Bits */
#define HSADC_ADCDMAINTSEL_DMAINT2SEL_OFS        (8)                             /* !< DMAINT2SEL Offset */
#define HSADC_ADCDMAINTSEL_DMAINT2SEL_MASK       ((uint32_t)0x00000F00U)         /* !< ADCDMAINT2 EOC Source Select #br#
                                                                                    00h  EOC0 is trigger for ADCDMAINT2
                                                                                    #br#  01h  EOC1 is trigger for
                                                                                    ADCDMAINT2 #br#  02h  EOC2 is trigger
                                                                                    for ADCDMAINT2 #br#  03h  EOC3 is
                                                                                    trigger for ADCDMAINT2 #br#  04h
                                                                                    EOC4 is trigger for ADCDMAINT2 #br#
                                                                                    05h  EOC5 is trigger for ADCDMAINT2
                                                                                    #br#  06h  EOC6 is trigger for
                                                                                    ADCDMAINT2 #br#  07h  EOC7 is trigger
                                                                                    for ADCDMAINT2 #br#  08h  EOC8 is
                                                                                    trigger for ADCDMAINT2 #br#  09h
                                                                                    EOC9 is trigger for ADCDMAINT2 #br#
                                                                                    0Ah  EOC10 is trigger for ADCDMAINT2
                                                                                    #br#  0Bh  EOC11 is trigger for
                                                                                    ADCDMAINT2 #br#  0Ch  EOC12 is
                                                                                    trigger for ADCDMAINT2 #br#  0Dh
                                                                                    EOC13 is trigger for ADCDMAINT2 #br#
                                                                                    0Eh  EOC14 is trigger for ADCDMAINT2
                                                                                    #br#  0Fh  EOC15 is trigger for
                                                                                    ADCDMAINT2 #br# #br#Note : When
                                                                                    oversampling is enabled, the end of
                                                                                    the last oversampled coversion will
                                                                                    trigger the DMAINTerrupts #br# */
/* HSADC_ADCDMAINTSEL[DMAINT2CONT] Bits */
#define HSADC_ADCDMAINTSEL_DMAINT2CONT_OFS       (14)                            /* !< DMAINT2CONT Offset */
#define HSADC_ADCDMAINTSEL_DMAINT2CONT_MASK      ((uint32_t)0x00004000U)         /* !< ADCDMAINT2 Continue to Interrupt
                                                                                    Mode #br#  0  No further ADCDMAINT2
                                                                                    pulses are generated until ADCDMAINT2
                                                                                    flag (in ADCDMAINTFLG register) is
                                                                                    cleared by user. #br#  1  ADCDMAINT2
                                                                                    pulses are generated whenever an EOC
                                                                                    pulse is generated irrespective of
                                                                                    whether the flag bit is cleared or
                                                                                    not. */
/* HSADC_ADCDMAINTSEL[DMAINT2E] Bits */
#define HSADC_ADCDMAINTSEL_DMAINT2E_OFS          (15)                            /* !< DMAINT2E Offset */
#define HSADC_ADCDMAINTSEL_DMAINT2E_MASK         ((uint32_t)0x00008000U)         /* !< ADCDMAINT2 Interrupt Enable #br#  0
                                                                                    ADCDMAINT2 is disabled #br#  1
                                                                                    ADCDMAINT2 is enabled */
/* HSADC_ADCDMAINTSEL[DMAINT3SEL] Bits */
#define HSADC_ADCDMAINTSEL_DMAINT3SEL_OFS        (16)                            /* !< DMAINT3SEL Offset */
#define HSADC_ADCDMAINTSEL_DMAINT3SEL_MASK       ((uint32_t)0x000F0000U)         /* !< ADCDMAINT3 EOC Source Select #br#
                                                                                    00h  EOC0 is trigger for ADCDMAINT3
                                                                                    #br#  01h  EOC1 is trigger for
                                                                                    ADCDMAINT3 #br#  02h  EOC2 is trigger
                                                                                    for ADCDMAINT3 #br#  03h  EOC3 is
                                                                                    trigger for ADCDMAINT3 #br#  04h
                                                                                    EOC4 is trigger for ADCDMAINT3 #br#
                                                                                    05h  EOC5 is trigger for ADCDMAINT3
                                                                                    #br#  06h  EOC6 is trigger for
                                                                                    ADCDMAINT3 #br#  07h  EOC7 is trigger
                                                                                    for ADCDMAINT3 #br#  08h  EOC8 is
                                                                                    trigger for ADCDMAINT3 #br#  09h
                                                                                    EOC9 is trigger for ADCDMAINT3 #br#
                                                                                    0Ah  EOC10 is trigger for ADCDMAINT3
                                                                                    #br#  0Bh  EOC11 is trigger for
                                                                                    ADCDMAINT3 #br#  0Ch  EOC12 is
                                                                                    trigger for ADCDMAINT3 #br#  0Dh
                                                                                    EOC13 is trigger for ADCDMAINT3 #br#
                                                                                    0Eh  EOC14 is trigger for ADCDMAINT3
                                                                                    #br#  0Fh  EOC15 is trigger for
                                                                                    ADCDMAINT3 #br# #br#Note : When
                                                                                    oversampling is enabled, the end of
                                                                                    the last oversampled coversion will
                                                                                    trigger the DMAINTerrupts #br# */
/* HSADC_ADCDMAINTSEL[DMAINT3CONT] Bits */
#define HSADC_ADCDMAINTSEL_DMAINT3CONT_OFS       (22)                            /* !< DMAINT3CONT Offset */
#define HSADC_ADCDMAINTSEL_DMAINT3CONT_MASK      ((uint32_t)0x00400000U)         /* !< ADCDMAINT3 Continue to Interrupt
                                                                                    Mode #br#  0  No further ADCDMAINT3
                                                                                    pulses are generated until ADCDMAINT3
                                                                                    flag (in ADCDMAINTFLG register) is
                                                                                    cleared by user. #br#  1  ADCDMAINT3
                                                                                    pulses are generated whenever an EOC
                                                                                    pulse is generated irrespective of
                                                                                    whether the flag bit is cleared or
                                                                                    not. */
/* HSADC_ADCDMAINTSEL[DMAINT3E] Bits */
#define HSADC_ADCDMAINTSEL_DMAINT3E_OFS          (23)                            /* !< DMAINT3E Offset */
#define HSADC_ADCDMAINTSEL_DMAINT3E_MASK         ((uint32_t)0x00800000U)         /* !< ADCDMAINT3 Interrupt Enable #br#  0
                                                                                    ADCDMAINT3 is disabled #br#  1
                                                                                    ADCDMAINT3 is enabled */
/* HSADC_ADCDMAINTSEL[DMAINT4SEL] Bits */
#define HSADC_ADCDMAINTSEL_DMAINT4SEL_OFS        (24)                            /* !< DMAINT4SEL Offset */
#define HSADC_ADCDMAINTSEL_DMAINT4SEL_MASK       ((uint32_t)0x0F000000U)         /* !< ADCDMAINT4 EOC Source Select #br#
                                                                                    00h  EOC0 is trigger for ADCDMAINT4
                                                                                    #br#  01h  EOC1 is trigger for
                                                                                    ADCDMAINT4 #br#  02h  EOC2 is trigger
                                                                                    for ADCDMAINT4 #br#  03h  EOC3 is
                                                                                    trigger for ADCDMAINT4 #br#  04h
                                                                                    EOC4 is trigger for ADCDMAINT4 #br#
                                                                                    05h  EOC5 is trigger for ADCDMAINT4
                                                                                    #br#  06h  EOC6 is trigger for
                                                                                    ADCDMAINT4 #br#  07h  EOC7 is trigger
                                                                                    for ADCDMAINT4 #br#  08h  EOC8 is
                                                                                    trigger for ADCDMAINT4 #br#  09h
                                                                                    EOC9 is trigger for ADCDMAINT4 #br#
                                                                                    0Ah  EOC10 is trigger for ADCDMAINT4
                                                                                    #br#  0Bh  EOC11 is trigger for
                                                                                    ADCDMAINT4 #br#  0Ch  EOC12 is
                                                                                    trigger for ADCDMAINT4 #br#  0Dh
                                                                                    EOC13 is trigger for ADCDMAINT4 #br#
                                                                                    0Eh  EOC14 is trigger for ADCDMAINT4
                                                                                    #br#  0Fh  EOC15 is trigger for
                                                                                    ADCDMAINT4 #br# #br#Note : When
                                                                                    oversampling is enabled, the end of
                                                                                    the last oversampled coversion will
                                                                                    trigger the DMAINTerrupts #br# */
/* HSADC_ADCDMAINTSEL[DMAINT4CONT] Bits */
#define HSADC_ADCDMAINTSEL_DMAINT4CONT_OFS       (30)                            /* !< DMAINT4CONT Offset */
#define HSADC_ADCDMAINTSEL_DMAINT4CONT_MASK      ((uint32_t)0x40000000U)         /* !< ADCDMAINT4 Continue to Interrupt
                                                                                    Mode #br#  0  No further ADCDMAINT4
                                                                                    pulses are generated until ADCDMAINT4
                                                                                    flag (in ADCDMAINTFLG register) is
                                                                                    cleared by user. #br#  1  ADCDMAINT4
                                                                                    pulses are generated whenever an EOC
                                                                                    pulse is generated irrespective of
                                                                                    whether the flag bit is cleared or
                                                                                    not. */
/* HSADC_ADCDMAINTSEL[DMAINT4E] Bits */
#define HSADC_ADCDMAINTSEL_DMAINT4E_OFS          (31)                            /* !< DMAINT4E Offset */
#define HSADC_ADCDMAINTSEL_DMAINT4E_MASK         ((uint32_t)0x80000000U)         /* !< ADCDMAINT4 Interrupt Enable #br#  0
                                                                                    ADCDMAINT4 is disabled #br#  1
                                                                                    ADCDMAINT4 is enabled */

