TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
                                                                                    the ADCINTOVF register. */
/* HSADC_ADCINTFLG[ADCDMAINT2] Bits */
#define HSADC_ADCINTFLG_ADCDMAINT2_OFS           (17)                            /* !< ADCDMAINT2 Offset */
#define HSADC_ADCINTFLG_ADCDMAINT2_MASK          ((uint32_t)0x00020000U)         /* !< ADC DMA Interrupt 2 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated ADCDMAINT pulse was
                                                                                    generated since the last clear. #br#
                                                                                    #br#  0  No ADC DMA interrupt pulse
                                                                                    generated #br#  1  ADC DMA interrupt
                                                                                    pulse generated #br# #br#If the ADC
                                                                                    DMA interrupt is placed in continue
                                                                                    to interrupt mode (DMAINTSEL
                                                                                    register) then further interrupt
                                                                                    pulses are generated whenever a
                                                                                    selected EOC event occurs even if the
                                                                                    flag bit is set. If the continuous
                                                                                    mode is not enabled, then no further
                                                                                    interrupt pulses are generated until
                                                                                    the user clears this flag bit using
                                                                                    the ADCINTFLGCLR register. Rather, an
                                                                                    ADC interrupt overflow event occurs
                                                                                    in the ADCINTOVF register. */
/* HSADC_ADCINTFLG[ADCDMAINT3] Bits */
#define HSADC_ADCINTFLG_ADCDMAINT3_OFS           (18)                            /* !< ADCDMAINT3 Offset */
#define HSADC_ADCINTFLG_ADCDMAINT3_MASK          ((uint32_t)0x00040000U)         /* !< ADC DMA Interrupt 3 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated ADCDMAINT pulse was
                                                                                    generated since the last clear. #br#
                                                                                    #br#  0  No ADC DMA interrupt pulse
                                                                                    generated #br#  1  ADC DMA interrupt
                                                                                    pulse generated #br# #br#If the ADC
                                                                                    interrupt is placed in continue to
                                                                                    interrupt mode (DMAINTSEL register)
                                                                                    then further interrupt pulses are
                                                                                    generated whenever a selected EOC
                                                                                    event occurs even if the flag bit is
                                                                                    set. If the continuous mode is not
                                                                                    enabled, then no further interrupt
                                                                                    pulses are generated until the user
                                                                                    clears this flag bit using the
                                                                                    ADCINTFLGCLR register. Rather, an ADC
                                                                                    interrupt overflow event occurs in
                                                                                    the ADCINTOVF register. */
/* HSADC_ADCINTFLG[ADCDMAINT4] Bits */
#define HSADC_ADCINTFLG_ADCDMAINT4_OFS           (19)                            /* !< ADCDMAINT4 Offset */
#define HSADC_ADCINTFLG_ADCDMAINT4_MASK          ((uint32_t)0x00080000U)         /* !< ADC DMA Interrupt 4 Flag. Reading
                                                                                    these flags indicates if the
                                                                                    associated ADCDMAINT pulse was
                                                                                    generated since the last clear. #br#
                                                                                    #br#  0  No ADC DMA interru4pt pulse
                                                                                    generated #br#  1  ADC DMA interrupt
                                                                                    pulse generated #br# #br#If the ADC
                                                                                    interrupt is placed in continue to
                                                                                    interrupt mode (DMAINTSEL register)
                                                                                    then further interrupt pulses are
                                                                                    generated whenever a selected EOC
                                                                                    event occurs even if the flag bit is
                                                                                    set. If the continuous mode is not
                                                                                    enabled, then no further interrupt
                                                                                    pulses are generated until the user
                                                                                    clears this flag bit using the
                                                                                    ADCINTFLGCLR register. Rather, an ADC
                                                                                    interrupt overflow event occurs in
                                                                                    the ADCINTOVF register. */

/* HSADC_ADCINTFLGFRC Bits */
/* HSADC_ADCINTFLGFRC[ADCINT1] Bits */
#define HSADC_ADCINTFLGFRC_ADCINT1_OFS           (0)                             /* !< ADCINT1 Offset */
#define HSADC_ADCINTFLGFRC_ADCINT1_MASK          ((uint32_t)0x00000001U)         /* !< ADC Interrupt 1 Flag Force. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Forces ADCINT1 flags in the
                                                                                    ADCINTFLG and ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC[ADCINT2] Bits */
#define HSADC_ADCINTFLGFRC_ADCINT2_OFS           (1)                             /* !< ADCINT2 Offset */
#define HSADC_ADCINTFLGFRC_ADCINT2_MASK          ((uint32_t)0x00000002U)         /* !< ADC Interrupt 2 Flag Force. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Forces ADCINT2 flags in the
                                                                                    ADCINTFLG and ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC[ADCINT3] Bits */
#define HSADC_ADCINTFLGFRC_ADCINT3_OFS           (2)                             /* !< ADCINT3 Offset */
#define HSADC_ADCINTFLGFRC_ADCINT3_MASK          ((uint32_t)0x00000004U)         /* !< ADC Interrupt 3 Flag Force. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Forces ADCINT3 flags in the
                                                                                    ADCINTFLG and ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC[ADCINT4] Bits */
#define HSADC_ADCINTFLGFRC_ADCINT4_OFS           (3)                             /* !< ADCINT4 Offset */
#define HSADC_ADCINTFLGFRC_ADCINT4_MASK          ((uint32_t)0x00000008U)         /* !< ADC Interrupt 4 Flag Force. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Forces ADCINT4 flags in the
                                                                                    ADCINTFLG and ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC[ADCDMAINT1] Bits */
#define HSADC_ADCINTFLGFRC_ADCDMAINT1_OFS        (16)                            /* !< ADCDMAINT1 Offset */
#define HSADC_ADCINTFLGFRC_ADCDMAINT1_MASK       ((uint32_t)0x00010000U)         /* !< ADC DMA interrupt 1 Flag Force.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Forces ADCDMAINT1
                                                                                    flags in the ADCINTFLG and
                                                                                    ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC[ADCDMAINT2] Bits */
#define HSADC_ADCINTFLGFRC_ADCDMAINT2_OFS        (17)                            /* !< ADCDMAINT2 Offset */
#define HSADC_ADCINTFLGFRC_ADCDMAINT2_MASK       ((uint32_t)0x00020000U)         /* !< ADC DMA interrupt 2 Flag Force.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Forces ADCDMAINT2
                                                                                    flags in the ADCINTFLG and
                                                                                    ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC[ADCDMAINT3] Bits */
#define HSADC_ADCINTFLGFRC_ADCDMAINT3_OFS        (18)                            /* !< ADCDMAINT3 Offset */
#define HSADC_ADCINTFLGFRC_ADCDMAINT3_MASK       ((uint32_t)0x00040000U)         /* !< ADC DMA interrupt 3 Flag Force.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Forces ADCDMAINT3
                                                                                    flags in the ADCINTFLG and
                                                                                    ADCRAWINTFLG registers. */
/* HSADC_ADCINTFLGFRC[ADCDMAINT4] Bits */
#define HSADC_ADCINTFLGFRC_ADCDMAINT4_OFS        (19)                            /* !< ADCDMAINT4 Offset */
#define HSADC_ADCINTFLGFRC_ADCDMAINT4_MASK       ((uint32_t)0x00080000U)         /* !< ADC DMA interrupt 4 Flag Force.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Forces ADCDMAINT4
                                                                                    flags in the ADCINTFLG and
                                                                                    ADCRAWINTFLG registers. */

/* HSADC_ADCINTFLGCLR Bits */
/* HSADC_ADCINTFLGCLR[ADCINT1] Bits */
#define HSADC_ADCINTFLGCLR_ADCINT1_OFS           (0)                             /* !< ADCINT1 Offset */
#define HSADC_ADCINTFLGCLR_ADCINT1_MASK          ((uint32_t)0x00000001U)         /* !< ADC Interrupt 1 Flag Clear. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Clears ADCINT1 and
                                                                                    ADCINT1RESULT flags in the ADCINTFLG,
                                                                                    ADCRAWINTFLG registers.  #br#If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority and the overflow bit will
                                                                                    not be set */
/* HSADC_ADCINTFLGCLR[ADCINT2] Bits */
#define HSADC_ADCINTFLGCLR_ADCINT2_OFS           (1)                             /* !< ADCINT2 Offset */
#define HSADC_ADCINTFLGCLR_ADCINT2_MASK          ((uint32_t)0x00000002U)         /* !< ADC Interrupt 2 Flag Clear. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Clears ADCINT2 and
                                                                                    ADCINT2RESULT flags in the ADCINTFLG,
                                                                                    ADCRAWINTFLG registers. If software
                                                                                    sets the clear bit on the same cycle
                                                                                    that hardware is trying to set the
                                                                                    flag bit, then hardware has priority
                                                                                    and the overflow bit will not be set */
/* HSADC_ADCINTFLGCLR[ADCINT3] Bits */
#define HSADC_ADCINTFLGCLR_ADCINT3_OFS           (2)                             /* !< ADCINT3 Offset */
#define HSADC_ADCINTFLGCLR_ADCINT3_MASK          ((uint32_t)0x00000004U)         /* !< ADC Interrupt 3 Flag Clear. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Clears ADCINT3 and
                                                                                    ADCINT3RESULT flags in the ADCINTFLG,
                                                                                    ADCRAWINTFLG registers. #br#  If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority and the overflow bit will
                                                                                    not be set */
/* HSADC_ADCINTFLGCLR[ADCINT4] Bits */
#define HSADC_ADCINTFLGCLR_ADCINT4_OFS           (3)                             /* !< ADCINT4 Offset */
#define HSADC_ADCINTFLGCLR_ADCINT4_MASK          ((uint32_t)0x00000008U)         /* !< ADC Interrupt 4 Flag Clear. Reads
                                                                                    return 0. #br# #br#  0  No action
                                                                                    #br#  1  Clears ADCINT4 and
                                                                                    ADCINT4RESULT flags in the
                                                                                    ADCINTFLG,, ADCRAWINTFLG registers.
                                                                                    #br#If software sets the clear bit on
                                                                                    the same cycle that hardware is
                                                                                    trying to set the flag bit, then
                                                                                    hardware has priority and the
                                                                                    overflow bit will not be set */
/* HSADC_ADCINTFLGCLR[ADCDMAINT1] Bits */
#define HSADC_ADCINTFLGCLR_ADCDMAINT1_OFS        (16)                            /* !< ADCDMAINT1 Offset */
#define HSADC_ADCINTFLGCLR_ADCDMAINT1_MASK       ((uint32_t)0x00010000U)         /* !< ADC DMA Interrupt 1 Flag Clear.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Clears ADDMACINT1
                                                                                    flags in the ADCINTFLG ,ADCRAWINTFLG
                                                                                    registers.  #br#If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority and
                                                                                    the overflow bit will not be set */
/* HSADC_ADCINTFLGCLR[ADCDMAINT2] Bits */
#define HSADC_ADCINTFLGCLR_ADCDMAINT2_OFS        (17)                            /* !< ADCDMAINT2 Offset */
#define HSADC_ADCINTFLGCLR_ADCDMAINT2_MASK       ((uint32_t)0x00020000U)         /* !< ADC DMA Interrupt 2 Flag Clear.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1   Clears ADDMACINT2
                                                                                    flags in the ADCINTFLG ,ADCRAWINTFLG
                                                                                    registers.   #br#If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority and
                                                                                    the overflow bit will not be set */
/* HSADC_ADCINTFLGCLR[ADCDMAINT3] Bits */
#define HSADC_ADCINTFLGCLR_ADCDMAINT3_OFS        (18)                            /* !< ADCDMAINT3 Offset */
#define HSADC_ADCINTFLGCLR_ADCDMAINT3_MASK       ((uint32_t)0x00040000U)         /* !< ADC DMA Interrupt 3 Flag Clear.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1   Clears ADDMACINT3
                                                                                    flags in the ADCINTFLG ,ADCRAWINTFLG
                                                                                    registers.  #br#  If software sets
                                                                                    the clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority and
                                                                                    the overflow bit will not be set */
/* HSADC_ADCINTFLGCLR[ADCDMAINT4] Bits */
#define HSADC_ADCINTFLGCLR_ADCDMAINT4_OFS        (19)                            /* !< ADCDMAINT4 Offset */
#define HSADC_ADCINTFLGCLR_ADCDMAINT4_MASK       ((uint32_t)0x00080000U)         /* !< ADC DMA Interrupt 4 Flag Clear.
                                                                                    Reads return 0. #br# #br#  0  No
                                                                                    action #br#  1  Clears ADDMACINT4
                                                                                    flags in the ADCINTFLG ,ADCRAWINTFLG
                                                                                    registers.  #br#If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority and
                                                                                    the overflow bit will not be set */

