TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCINTOVF Bits */
/* HSADC_ADCINTOVF[ADCINT1OVF] Bits */
#define HSADC_ADCINTOVF_ADCINT1OVF_OFS           (0)                             /* !< ADCINT1OVF Offset */
#define HSADC_ADCINTOVF_ADCINT1OVF_MASK          ((uint32_t)0x00000001U)         /* !< ADC Interrupt 1 Overflow Flags #br#
                                                                                    #br#Indicates if an overflow occurred
                                                                                    when generating ADCINT pulses. If the
                                                                                    respective ADCINTFLG bit is set and a
                                                                                    selected additional EOC trigger is
                                                                                    generated, then an overflow condition
                                                                                    occurs. #br# #br#  0  No ADC
                                                                                    interrupt overflow event detected.
                                                                                    #br#  1  ADC Interrupt overflow event
                                                                                    detected. #br# #br#The overflow bit
                                                                                    does not care about the continuous
                                                                                    mode bit state. An overflow condition
                                                                                    is generated irrespective of this
                                                                                    mode selection. */
/* HSADC_ADCINTOVF[ADCINT2OVF] Bits */
#define HSADC_ADCINTOVF_ADCINT2OVF_OFS           (1)                             /* !< ADCINT2OVF Offset */
#define HSADC_ADCINTOVF_ADCINT2OVF_MASK          ((uint32_t)0x00000002U)         /* !< ADC Interrupt 2 Overflow Flags #br#
                                                                                    #br#Indicates if an overflow occurred
                                                                                    when generating ADCINT pulses. If the
                                                                                    respective ADCINTFLG bit is set and a
                                                                                    selected additional EOC trigger is
                                                                                    generated, then an overflow condition
                                                                                    occurs. #br# #br#  0  No ADC
                                                                                    interrupt overflow event detected.
                                                                                    #br#  1  ADC Interrupt overflow event
                                                                                    detected. #br# #br#The overflow bit
                                                                                    does not care about the continuous
                                                                                    mode bit state. An overflow condition
                                                                                    is generated irrespective of this
                                                                                    mode selection. */
/* HSADC_ADCINTOVF[ADCINT3OVF] Bits */
#define HSADC_ADCINTOVF_ADCINT3OVF_OFS           (2)                             /* !< ADCINT3OVF Offset */
#define HSADC_ADCINTOVF_ADCINT3OVF_MASK          ((uint32_t)0x00000004U)         /* !< ADC Interrupt 3 Overflow Flags #br#
                                                                                    #br#Indicates if an overflow occurred
                                                                                    when generating ADCINT pulses. If the
                                                                                    respective ADCINTFLG bit is set and a
                                                                                    selected additional EOC trigger is
                                                                                    generated, then an overflow condition
                                                                                    occurs. #br# #br#  0  No ADC
                                                                                    interrupt overflow event detected.
                                                                                    #br#  1  ADC Interrupt overflow event
                                                                                    detected. #br# #br#The overflow bit
                                                                                    does not care about the continuous
                                                                                    mode bit state. An overflow condition
                                                                                    is generated irrespective of this
                                                                                    mode selection. */
/* HSADC_ADCINTOVF[ADCINT4OVF] Bits */
#define HSADC_ADCINTOVF_ADCINT4OVF_OFS           (3)                             /* !< ADCINT4OVF Offset */
#define HSADC_ADCINTOVF_ADCINT4OVF_MASK          ((uint32_t)0x00000008U)         /* !< ADC Interrupt 4 Overflow Flags #br#
                                                                                    #br#Indicates if an overflow occurred
                                                                                    when generating ADCINT pulses. If the
                                                                                    respective ADCINTFLG bit is set and a
                                                                                    selected additional EOC trigger is
                                                                                    generated, then an overflow condition
                                                                                    occurs. #br# #br#  0  No ADC
                                                                                    interrupt overflow event detected.
                                                                                    #br#  1  ADC Interrupt overflow event
                                                                                    detected. #br# #br#The overflow bit
                                                                                    does not care about the continuous
                                                                                    mode bit state. An overflow condition
                                                                                    is generated irrespective of this
                                                                                    mode selection. */
/* HSADC_ADCINTOVF[ADCDMAINT1OVF] Bits */
#define HSADC_ADCINTOVF_ADCDMAINT1OVF_OFS        (16)                            /* !< ADCDMAINT1OVF Offset */
#define HSADC_ADCINTOVF_ADCDMAINT1OVF_MASK       ((uint32_t)0x00010000U)         /* !< ADC DMA Interrupt 1 Overflow Flags
                                                                                    #br# #br#Indicates if an overflow
                                                                                    occurred when generating ADCINT
                                                                                    pulses. If the respective ADCINTFLG
                                                                                    bit is set and a selected additional
                                                                                    EOC trigger is generated, then an
                                                                                    overflow condition occurs. #br# #br#
                                                                                    0  No ADC DMA Interrupt overflow
                                                                                    event detected. #br#  1  ADC DMA
                                                                                    Interrupt overflow event detected.
                                                                                    #br# #br#The overflow bit does not
                                                                                    care about the continuous mode bit
                                                                                    state. An overflow condition is
                                                                                    generated irrespective of this mode
                                                                                    selection. */
/* HSADC_ADCINTOVF[ADCDMAINT2OVF] Bits */
#define HSADC_ADCINTOVF_ADCDMAINT2OVF_OFS        (17)                            /* !< ADCDMAINT2OVF Offset */
#define HSADC_ADCINTOVF_ADCDMAINT2OVF_MASK       ((uint32_t)0x00020000U)         /* !< ADC DMA Interrupt 2 Overflow Flags
                                                                                    #br# #br#Indicates if an overflow
                                                                                    occurred when generating ADCINT
                                                                                    pulses. If the respective ADCINTFLG
                                                                                    bit is set and a selected additional
                                                                                    EOC trigger is generated, then an
                                                                                    overflow condition occurs. #br# #br#
                                                                                    0  No ADC DMA Interrupt overflow
                                                                                    event detected. #br#  1  ADC DMA
                                                                                    Interrupt overflow event detected.
                                                                                    #br# #br#The overflow bit does not
                                                                                    care about the continuous mode bit
                                                                                    state. An overflow condition is
                                                                                    generated irrespective of this mode
                                                                                    selection. */
/* HSADC_ADCINTOVF[ADCDMAINT3OVF] Bits */
#define HSADC_ADCINTOVF_ADCDMAINT3OVF_OFS        (18)                            /* !< ADCDMAINT3OVF Offset */
#define HSADC_ADCINTOVF_ADCDMAINT3OVF_MASK       ((uint32_t)0x00040000U)         /* !< ADC DMA Interrupt 3 Overflow Flags
                                                                                    #br# #br#Indicates if an overflow
                                                                                    occurred when generating ADCINT
                                                                                    pulses. If the respective ADCINTFLG
                                                                                    bit is set and a selected additional
                                                                                    EOC trigger is generated, then an
                                                                                    overflow condition occurs. #br# #br#
                                                                                    0  No ADC DMA Interrupt overflow
                                                                                    event detected. #br#  1  ADC DMA
                                                                                    Interrupt overflow event detected.
                                                                                    #br# #br#The overflow bit does not
                                                                                    care about the continuous mode bit
                                                                                    state. An overflow condition is
                                                                                    generated irrespective of this mode
                                                                                    selection. */
/* HSADC_ADCINTOVF[ADCDMAINT4OVF] Bits */
#define HSADC_ADCINTOVF_ADCDMAINT4OVF_OFS        (19)                            /* !< ADCDMAINT4OVF Offset */
#define HSADC_ADCINTOVF_ADCDMAINT4OVF_MASK       ((uint32_t)0x00080000U)         /* !< ADC DMA Interrupt 4 Overflow Flags
                                                                                    #br# #br#Indicates if an overflow
                                                                                    occurred when generating ADCINT
                                                                                    pulses. If the respective ADCINTFLG
                                                                                    bit is set and a selected additional
                                                                                    EOC trigger is generated, then an
                                                                                    overflow condition occurs. #br# #br#
                                                                                    0  No ADC DMA Interrupt overflow
                                                                                    event detected. #br#  1  ADC DMA
                                                                                    Interrupt overflow event detected.
                                                                                    #br# #br#The overflow bit does not
                                                                                    care about the continuous mode bit
                                                                                    state. An overflow condition is
                                                                                    generated irrespective of this mode
                                                                                    selection. */

