TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
                                                                                    the SOC14 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC14 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */
/* HSADC_ADCSOCOVFCLR1[SOC15OVF] Bits */
#define HSADC_ADCSOCOVFCLR1_SOC15OVF_OFS         (15)                            /* !< SOC15OVF Offset */
#define HSADC_ADCSOCOVFCLR1_SOC15OVF_MASK        ((uint32_t)0x00008000U)         /* !< SOC15 Clear Start of Conversion
                                                                                    Overflow Bit. Writing a 1 will clear
                                                                                    the SOC15 overflow flag in the
                                                                                    ADCSOCOVF1 register. Writes of 0 are
                                                                                    ignored. Reads will always return a
                                                                                    0. #br# #br#  0  No action. #br#  1
                                                                                    Clear SOC15 overflow flag. #br#
                                                                                    #br#If software tries to set this bit
                                                                                    on the same clock cycle that hardware
                                                                                    tries to set the overflow bit in the
                                                                                    ADCSOCOVF1 register, then hardware
                                                                                    has priority and the ADCSOCOVF1 bit
                                                                                    will be set.. */

/* HSADC_ADCSOC0CTL Bits */
/* HSADC_ADCSOC0CTL[CHSEL] Bits */
#define HSADC_ADCSOC0CTL_CHSEL_OFS               (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC0CTL_CHSEL_MASK              ((uint32_t)0x000F8000U)         /* !< SOC0 Channel Select. Selects the
                                                                                    channel to be converted when SOC0 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC0CTL[COMPEN] Bits */
#define HSADC_ADCSOC0CTL_COMPEN_OFS              (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC0CTL_COMPEN_MASK             ((uint32_t)0x02000000U)         /* !< SOC0 Threshold comparator enable. */

/* HSADC_ADCSOC1CTL Bits */
/* HSADC_ADCSOC1CTL[CHSEL] Bits */
#define HSADC_ADCSOC1CTL_CHSEL_OFS               (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC1CTL_CHSEL_MASK              ((uint32_t)0x000F8000U)         /* !< SOC1 Channel Select. Selects the
                                                                                    channel to be converted when SOC1 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC1CTL[COMPEN] Bits */
#define HSADC_ADCSOC1CTL_COMPEN_OFS              (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC1CTL_COMPEN_MASK             ((uint32_t)0x02000000U)         /* !< SOC1 Threshold comparator enable. */

/* HSADC_ADCSOC2CTL Bits */
/* HSADC_ADCSOC2CTL[CHSEL] Bits */
#define HSADC_ADCSOC2CTL_CHSEL_OFS               (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC2CTL_CHSEL_MASK              ((uint32_t)0x000F8000U)         /* !< SOC2 Channel Select. Selects the
                                                                                    channel to be converted when SOC2 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC2CTL[COMPEN] Bits */
#define HSADC_ADCSOC2CTL_COMPEN_OFS              (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC2CTL_COMPEN_MASK             ((uint32_t)0x02000000U)         /* !< SOC2 Threshold comparator enable. */

