TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCSOC3CTL Bits */
/* HSADC_ADCSOC3CTL[CHSEL] Bits */
#define HSADC_ADCSOC3CTL_CHSEL_OFS               (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC3CTL_CHSEL_MASK              ((uint32_t)0x000F8000U)         /* !< SOC3 Channel Select. Selects the
                                                                                    channel to be converted when SOC3 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC3CTL[COMPEN] Bits */
#define HSADC_ADCSOC3CTL_COMPEN_OFS              (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC3CTL_COMPEN_MASK             ((uint32_t)0x02000000U)         /* !< SOC3 Threshold comparator enable. */

/* HSADC_ADCSOC4CTL Bits */
/* HSADC_ADCSOC4CTL[CHSEL] Bits */
#define HSADC_ADCSOC4CTL_CHSEL_OFS               (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC4CTL_CHSEL_MASK              ((uint32_t)0x000F8000U)         /* !< SOC4 Channel Select. Selects the
                                                                                    channel to be converted when SOC4 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC4CTL[COMPEN] Bits */
#define HSADC_ADCSOC4CTL_COMPEN_OFS              (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC4CTL_COMPEN_MASK             ((uint32_t)0x02000000U)         /* !< SOC4 Threshold comparator enable. */

/* HSADC_ADCSOC5CTL Bits */
/* HSADC_ADCSOC5CTL[CHSEL] Bits */
#define HSADC_ADCSOC5CTL_CHSEL_OFS               (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC5CTL_CHSEL_MASK              ((uint32_t)0x000F8000U)         /* !< SOC5 Channel Select. Selects the
                                                                                    channel to be converted when SOC5 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC5CTL[COMPEN] Bits */
#define HSADC_ADCSOC5CTL_COMPEN_OFS              (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC5CTL_COMPEN_MASK             ((uint32_t)0x02000000U)         /* !< SOC5 Threshold comparator enable. */

/* HSADC_ADCSOC6CTL Bits */
/* HSADC_ADCSOC6CTL[CHSEL] Bits */
#define HSADC_ADCSOC6CTL_CHSEL_OFS               (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC6CTL_CHSEL_MASK              ((uint32_t)0x000F8000U)         /* !< SOC6 Channel Select. Selects the
                                                                                    channel to be converted when SOC6 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC6CTL[COMPEN] Bits */
#define HSADC_ADCSOC6CTL_COMPEN_OFS              (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC6CTL_COMPEN_MASK             ((uint32_t)0x02000000U)         /* !< SOC6 Threshold comparator enable. */

/* HSADC_ADCSOC7CTL Bits */
/* HSADC_ADCSOC7CTL[CHSEL] Bits */
#define HSADC_ADCSOC7CTL_CHSEL_OFS               (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC7CTL_CHSEL_MASK              ((uint32_t)0x000F8000U)         /* !< SOC7 Channel Select. Selects the
                                                                                    channel to be converted when SOC7 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC7CTL[COMPEN] Bits */
#define HSADC_ADCSOC7CTL_COMPEN_OFS              (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC7CTL_COMPEN_MASK             ((uint32_t)0x02000000U)         /* !< SOC7 Threshold comparator enable. */

/* HSADC_ADCSOC8CTL Bits */
/* HSADC_ADCSOC8CTL[CHSEL] Bits */
#define HSADC_ADCSOC8CTL_CHSEL_OFS               (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC8CTL_CHSEL_MASK              ((uint32_t)0x000F8000U)         /* !< SOC8 Channel Select. Selects the
                                                                                    channel to be converted when SOC8 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC8CTL[COMPEN] Bits */
#define HSADC_ADCSOC8CTL_COMPEN_OFS              (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC8CTL_COMPEN_MASK             ((uint32_t)0x02000000U)         /* !< SOC8 Threshold comparator enable. */

/* HSADC_ADCSOC9CTL Bits */
/* HSADC_ADCSOC9CTL[CHSEL] Bits */
#define HSADC_ADCSOC9CTL_CHSEL_OFS               (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC9CTL_CHSEL_MASK              ((uint32_t)0x000F8000U)         /* !< SOC9 Channel Select. Selects the
                                                                                    channel to be converted when SOC9 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC9CTL[COMPEN] Bits */
#define HSADC_ADCSOC9CTL_COMPEN_OFS              (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC9CTL_COMPEN_MASK             ((uint32_t)0x02000000U)         /* !< SOC9 Threshold comparator enable. */

/* HSADC_ADCSOC10CTL Bits */
/* HSADC_ADCSOC10CTL[CHSEL] Bits */
#define HSADC_ADCSOC10CTL_CHSEL_OFS              (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC10CTL_CHSEL_MASK             ((uint32_t)0x000F8000U)         /* !< SOC10 Channel Select. Selects the
                                                                                    channel to be converted when SOC10 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC10CTL[COMPEN] Bits */
#define HSADC_ADCSOC10CTL_COMPEN_OFS             (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC10CTL_COMPEN_MASK            ((uint32_t)0x02000000U)         /* !< SOC10 Threshold comparator enable. */

