TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCSOC11CTL Bits */
/* HSADC_ADCSOC11CTL[CHSEL] Bits */
#define HSADC_ADCSOC11CTL_CHSEL_OFS              (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC11CTL_CHSEL_MASK             ((uint32_t)0x000F8000U)         /* !< SOC11 Channel Select. Selects the
                                                                                    channel to be converted when SOC11 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC11CTL[COMPEN] Bits */
#define HSADC_ADCSOC11CTL_COMPEN_OFS             (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC11CTL_COMPEN_MASK            ((uint32_t)0x02000000U)         /* !< SOC11 Threshold comparator enable. */

/* HSADC_ADCSOC12CTL Bits */
/* HSADC_ADCSOC12CTL[CHSEL] Bits */
#define HSADC_ADCSOC12CTL_CHSEL_OFS              (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC12CTL_CHSEL_MASK             ((uint32_t)0x000F8000U)         /* !< SOC12 Channel Select. Selects the
                                                                                    channel to be converted when SOC12 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC12CTL[COMPEN] Bits */
#define HSADC_ADCSOC12CTL_COMPEN_OFS             (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC12CTL_COMPEN_MASK            ((uint32_t)0x02000000U)         /* !< SOC12 Threshold comparator enable. */

/* HSADC_ADCSOC13CTL Bits */
/* HSADC_ADCSOC13CTL[CHSEL] Bits */
#define HSADC_ADCSOC13CTL_CHSEL_OFS              (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC13CTL_CHSEL_MASK             ((uint32_t)0x000F8000U)         /* !< SOC13 Channel Select. Selects the
                                                                                    channel to be converted when SOC13 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC13CTL[COMPEN] Bits */
#define HSADC_ADCSOC13CTL_COMPEN_OFS             (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC13CTL_COMPEN_MASK            ((uint32_t)0x02000000U)         /* !< SOC13 Threshold comparator enable. */

/* HSADC_ADCSOC14CTL Bits */
/* HSADC_ADCSOC14CTL[CHSEL] Bits */
#define HSADC_ADCSOC14CTL_CHSEL_OFS              (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC14CTL_CHSEL_MASK             ((uint32_t)0x000F8000U)         /* !< SOC14 Channel Select. Selects the
                                                                                    channel to be converted when SOC14 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC14CTL[COMPEN] Bits */
#define HSADC_ADCSOC14CTL_COMPEN_OFS             (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC14CTL_COMPEN_MASK            ((uint32_t)0x02000000U)         /* !< SOC14 Threshold comparator enable. */

/* HSADC_ADCSOC15CTL Bits */
/* HSADC_ADCSOC15CTL[CHSEL] Bits */
#define HSADC_ADCSOC15CTL_CHSEL_OFS              (15)                            /* !< CHSEL Offset */
#define HSADC_ADCSOC15CTL_CHSEL_MASK             ((uint32_t)0x000F8000U)         /* !< SOC15 Channel Select. Selects the
                                                                                    channel to be converted when SOC15 is
                                                                                    received by the ADC. #br#  00h
                                                                                    ADCIN0 #br#  01h  ADCIN1 #br#  02h
                                                                                    ADCIN2 #br#  03h  ADCIN3 #br#  ...
                                                                                    #br#  1Dh  ADCIN29 #br#  1Eh  ADCIN30
                                                                                    #br#  1Fh  ADCIN31 */
/* HSADC_ADCSOC15CTL[COMPEN] Bits */
#define HSADC_ADCSOC15CTL_COMPEN_OFS             (25)                            /* !< COMPEN Offset */
#define HSADC_ADCSOC15CTL_COMPEN_MASK            ((uint32_t)0x02000000U)         /* !< SOC15 Threshold comparator enable. */

