TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
                                                                                    this, an ISR may need to examine both
                                                                                    the ADCEVTSTAT and ADCEVTINTSEL
                                                                                    registers to determine the source of
                                                                                    the interrupt.  #br# #br#Note: If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority */
/* HSADC_ADCEVTSTAT[PPB4TRIPLO] Bits */
#define HSADC_ADCEVTSTAT_PPB4TRIPLO_OFS          (13)                            /* !< PPB4TRIPLO Offset */
#define HSADC_ADCEVTSTAT_PPB4TRIPLO_MASK         ((uint32_t)0x00002000U)         /* !< Post Processing Block 4 Trip Low
                                                                                    Flag. When set indicates a digital
                                                                                    compare trip low event has occurred.
                                                                                    #br# #br#Note: these bits are set
                                                                                    even when the corresponding enable in
                                                                                    ADCEVTINTSEL is not set.  Because of
                                                                                    this, an ISR may need to examine both
                                                                                    the ADCEVTSTAT and ADCEVTINTSEL
                                                                                    registers to determine the source of
                                                                                    the interrupt.  #br# #br#Note: If
                                                                                    software sets the clear bit on the
                                                                                    same cycle that hardware is trying to
                                                                                    set the flag bit, then hardware has
                                                                                    priority */
/* HSADC_ADCEVTSTAT[PPB4ZERO] Bits */
#define HSADC_ADCEVTSTAT_PPB4ZERO_OFS            (14)                            /* !< PPB4ZERO Offset */
#define HSADC_ADCEVTSTAT_PPB4ZERO_MASK           ((uint32_t)0x00004000U)         /* !< Post Processing Block 4 Zero
                                                                                    Crossing Flag. When set indicates the
                                                                                    ADCPPB4RESULT register has changed
                                                                                    sign. This bit is gated by EOC
                                                                                    signal. #br# #br#Note: these bits are
                                                                                    set even when the corresponding
                                                                                    enable in ADCEVTINTSEL is not set.
                                                                                    Because of this, an ISR may need to
                                                                                    examine both the ADCEVTSTAT and
                                                                                    ADCEVTINTSEL registers to determine
                                                                                    the source of the interrupt.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC_ADCEVTSTAT[PPB4INLIMIT] Bits */
#define HSADC_ADCEVTSTAT_PPB4INLIMIT_OFS         (15)                            /* !< PPB4INLIMIT Offset */
#define HSADC_ADCEVTSTAT_PPB4INLIMIT_MASK        ((uint32_t)0x00008000U)         /* !< Post Processing Block 4 Within trip
                                                                                    limit Flag.  When set indicates a
                                                                                    digital compare within limit event
                                                                                    has occurred. This will be set when
                                                                                    the PPB result is either in between
                                                                                    or equal to the TRIPHI and TRIPLO
                                                                                    thresholds. #br# #br#Note: these bits
                                                                                    are set even when the corresponding
                                                                                    enable in ADCEVTINTSEL is not set.
                                                                                    Because of this, an ISR may need to
                                                                                    examine both the ADCEVTSTAT and
                                                                                    ADCEVTINTSEL registers to determine
                                                                                    the source of the interrupt.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */

/* HSADC_ADCEVTCLR Bits */
/* HSADC_ADCEVTCLR[PPB1TRIPHI] Bits */
#define HSADC_ADCEVTCLR_PPB1TRIPHI_OFS           (0)                             /* !< PPB1TRIPHI Offset */
#define HSADC_ADCEVTCLR_PPB1TRIPHI_MASK          ((uint32_t)0x00000001U)         /* !< Post Processing Block 1 Trip High
                                                                                    Clear. Clears the corresponding trip
                                                                                    high flag in the ADCEVTSTAT register.
                                                                                    #br# #br#Note: If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority */
/* HSADC_ADCEVTCLR[PPB1TRIPLO] Bits */
#define HSADC_ADCEVTCLR_PPB1TRIPLO_OFS           (1)                             /* !< PPB1TRIPLO Offset */
#define HSADC_ADCEVTCLR_PPB1TRIPLO_MASK          ((uint32_t)0x00000002U)         /* !< Post Processing Block 1 Trip Low
                                                                                    Clear. Clears the corresponding trip
                                                                                    low flag in the ADCEVTSTAT register.
                                                                                    #br# #br#Note: If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority */
/* HSADC_ADCEVTCLR[PPB1ZERO] Bits */
#define HSADC_ADCEVTCLR_PPB1ZERO_OFS             (2)                             /* !< PPB1ZERO Offset */
#define HSADC_ADCEVTCLR_PPB1ZERO_MASK            ((uint32_t)0x00000004U)         /* !< Post Processing Block 1 Zero
                                                                                    Crossing Clear. Clears the
                                                                                    corresponding zero crossing flag in
                                                                                    the ADCEVTSTAT register. #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC_ADCEVTCLR[PPB1INLIMIT] Bits */
#define HSADC_ADCEVTCLR_PPB1INLIMIT_OFS          (3)                             /* !< PPB1INLIMIT Offset */
#define HSADC_ADCEVTCLR_PPB1INLIMIT_MASK         ((uint32_t)0x00000008U)         /* !< Post Processing Block 1 Within trip
                                                                                    limit flag Clear, Clears the
                                                                                    corresponding within trip limit flag
                                                                                    in the ADCEVTSTAT register. #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC_ADCEVTCLR[PPB2TRIPHI] Bits */
#define HSADC_ADCEVTCLR_PPB2TRIPHI_OFS           (4)                             /* !< PPB2TRIPHI Offset */
#define HSADC_ADCEVTCLR_PPB2TRIPHI_MASK          ((uint32_t)0x00000010U)         /* !< Post Processing Block 2 Trip High
                                                                                    Clear. Clears the corresponding trip
                                                                                    high flag in the ADCEVTSTAT register.
                                                                                    #br# #br#Note: If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority */
/* HSADC_ADCEVTCLR[PPB2TRIPLO] Bits */
#define HSADC_ADCEVTCLR_PPB2TRIPLO_OFS           (5)                             /* !< PPB2TRIPLO Offset */
#define HSADC_ADCEVTCLR_PPB2TRIPLO_MASK          ((uint32_t)0x00000020U)         /* !< Post Processing Block 2 Trip Low
                                                                                    Clear. Clears the corresponding trip
                                                                                    low flag in the ADCEVTSTAT register.
                                                                                    #br# #br#Note: If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority */
/* HSADC_ADCEVTCLR[PPB2ZERO] Bits */
#define HSADC_ADCEVTCLR_PPB2ZERO_OFS             (6)                             /* !< PPB2ZERO Offset */
#define HSADC_ADCEVTCLR_PPB2ZERO_MASK            ((uint32_t)0x00000040U)         /* !< Post Processing Block 2 Zero
                                                                                    Crossing Clear. Clears the
                                                                                    corresponding zero crossing flag in
                                                                                    the ADCEVTSTAT register. #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC_ADCEVTCLR[PPB2INLIMIT] Bits */
#define HSADC_ADCEVTCLR_PPB2INLIMIT_OFS          (7)                             /* !< PPB2INLIMIT Offset */
#define HSADC_ADCEVTCLR_PPB2INLIMIT_MASK         ((uint32_t)0x00000080U)         /* !< Post Processing Block 2 Within trip
                                                                                    limit flag Clear, Clears the
                                                                                    corresponding within trip limit flag
                                                                                    in the ADCEVTSTAT register. #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC_ADCEVTCLR[PPB3TRIPHI] Bits */
#define HSADC_ADCEVTCLR_PPB3TRIPHI_OFS           (8)                             /* !< PPB3TRIPHI Offset */
#define HSADC_ADCEVTCLR_PPB3TRIPHI_MASK          ((uint32_t)0x00000100U)         /* !< Post Processing Block 3 Trip High
                                                                                    Clear. Clears the corresponding trip
                                                                                    high flag in the ADCEVTSTAT register.
                                                                                    #br# #br#Note: If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority */
/* HSADC_ADCEVTCLR[PPB3TRIPLO] Bits */
#define HSADC_ADCEVTCLR_PPB3TRIPLO_OFS           (9)                             /* !< PPB3TRIPLO Offset */
#define HSADC_ADCEVTCLR_PPB3TRIPLO_MASK          ((uint32_t)0x00000200U)         /* !< Post Processing Block 3 Trip Low
                                                                                    Clear. Clears the corresponding trip
                                                                                    low flag in the ADCEVTSTAT register.
                                                                                    #br# #br#Note: If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority */
/* HSADC_ADCEVTCLR[PPB3ZERO] Bits */
#define HSADC_ADCEVTCLR_PPB3ZERO_OFS             (10)                            /* !< PPB3ZERO Offset */
#define HSADC_ADCEVTCLR_PPB3ZERO_MASK            ((uint32_t)0x00000400U)         /* !< Post Processing Block 3 Zero
                                                                                    Crossing Clear. Clears the
                                                                                    corresponding zero crossing flag in
                                                                                    the ADCEVTSTAT register. #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC_ADCEVTCLR[PPB3INLIMIT] Bits */
#define HSADC_ADCEVTCLR_PPB3INLIMIT_OFS          (11)                            /* !< PPB3INLIMIT Offset */
#define HSADC_ADCEVTCLR_PPB3INLIMIT_MASK         ((uint32_t)0x00000800U)         /* !< Post Processing Block 3 Within trip
                                                                                    limit flag Clear, Clears the
                                                                                    corresponding within trip limit flag
                                                                                    in the ADCEVTSTAT register. #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC_ADCEVTCLR[PPB4TRIPHI] Bits */
#define HSADC_ADCEVTCLR_PPB4TRIPHI_OFS           (12)                            /* !< PPB4TRIPHI Offset */
#define HSADC_ADCEVTCLR_PPB4TRIPHI_MASK          ((uint32_t)0x00001000U)         /* !< Post Processing Block 4 Trip High
                                                                                    Clear. Clears the corresponding trip
                                                                                    high flag in the ADCEVTSTAT register.
                                                                                    #br# #br#Note: If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority */
/* HSADC_ADCEVTCLR[PPB4TRIPLO] Bits */
#define HSADC_ADCEVTCLR_PPB4TRIPLO_OFS           (13)                            /* !< PPB4TRIPLO Offset */
#define HSADC_ADCEVTCLR_PPB4TRIPLO_MASK          ((uint32_t)0x00002000U)         /* !< Post Processing Block 4 Trip Low
                                                                                    Clear. Clears the corresponding trip
                                                                                    low flag in the ADCEVTSTAT register.
                                                                                    #br# #br#Note: If software sets the
                                                                                    clear bit on the same cycle that
                                                                                    hardware is trying to set the flag
                                                                                    bit, then hardware has priority */
/* HSADC_ADCEVTCLR[PPB4ZERO] Bits */
#define HSADC_ADCEVTCLR_PPB4ZERO_OFS             (14)                            /* !< PPB4ZERO Offset */
#define HSADC_ADCEVTCLR_PPB4ZERO_MASK            ((uint32_t)0x00004000U)         /* !< Post Processing Block 4 Zero
                                                                                    Crossing Clear. Clears the
                                                                                    corresponding zero crossing flag in
                                                                                    the ADCEVTSTAT register. #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */
/* HSADC_ADCEVTCLR[PPB4INLIMIT] Bits */
#define HSADC_ADCEVTCLR_PPB4INLIMIT_OFS          (15)                            /* !< PPB4INLIMIT Offset */
#define HSADC_ADCEVTCLR_PPB4INLIMIT_MASK         ((uint32_t)0x00008000U)         /* !< Post Processing Block 4 Within trip
                                                                                    limit flag Clear, Clears the
                                                                                    corresponding within trip limit flag
                                                                                    in the ADCEVTSTAT register. #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority */

