TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCOSDETECT Bits */
/* HSADC_ADCOSDETECT[DETECTCFG] Bits */
#define HSADC_ADCOSDETECT_DETECTCFG_OFS          (0)                             /* !< DETECTCFG Offset */
#define HSADC_ADCOSDETECT_DETECTCFG_MASK         ((uint32_t)0x00000007U)         /* !< ADC Opens and Shorts Detect
                                                                                    Configuration. This bit field defines
                                                                                    the open/shorts detection circuit
                                                                                    state. #br# #br#  0h  Open/Shorts
                                                                                    detection circuit is disabled. #br#
                                                                                    1h  Open/Shorts detection circuit is
                                                                                    enabled at zero scale. #br#  2h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at full scale. #br#  3h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 5/12 scale. #br#
                                                                                    4h  Open/Shorts detection circuit is
                                                                                    enabled at (nominal) 7/12 scale. #br#
                                                                                    5h  Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 5K pulldown
                                                                                    to VSSA. #br#  6h  Open/Shorts
                                                                                    detection circuit is enabled with a
                                                                                    (nominal) 5K pullup to VDDA. #br#  7h
                                                                                    Open/Shorts detection circuit is
                                                                                    enabled with a (nominal) 7K pulldown
                                                                                    to VSSA. */

/* HSADC_ADCREV Bits */
/* HSADC_ADCREV[TYPE] Bits */
#define HSADC_ADCREV_TYPE_OFS                    (0)                             /* !< TYPE Offset */
#define HSADC_ADCREV_TYPE_MASK                   ((uint32_t)0x000000FFU)         /* !< ADC Type. Always set to 6 for this
                                                                                    HSADC-12b. */
/* HSADC_ADCREV[REV] Bits */
#define HSADC_ADCREV_REV_OFS                     (8)                             /* !< REV Offset */
#define HSADC_ADCREV_REV_MASK                    ((uint32_t)0xFFFFFF00U)         /* !< ADC Revision. To allow
                                                                                    documentation of differences between
                                                                                    revisions. First version is labeled
                                                                                    as 00h. */

/* HSADC_ADCOFFTRIM Bits */
/* HSADC_ADCOFFTRIM[OFFTRIM] Bits */
#define HSADC_ADCOFFTRIM_OFFTRIM_OFS             (0)                             /* !< OFFTRIM Offset */
#define HSADC_ADCOFFTRIM_OFFTRIM_MASK            ((uint32_t)0x000000FFU)         /* !< ADC Offset Trim #br# #br#Adjusts
                                                                                    the conversion results of the
                                                                                    converter up #br#or down to account
                                                                                    for offset error in the ADC. A
                                                                                    factory trim setting will be loaded
                                                                                    during device boot. #br# #br#Offset
                                                                                    can be corrected in the range of +7
                                                                                    to -8 LSBs. Value is 16*Offset in
                                                                                    8-bit 2's complement: #br# #br#7 LSB
                                                                                    (16*7) = 112 #br#6 LSB (16*6) = 96
                                                                                    #br#5 LSB (16*5) = 80 #br#4 LSB
                                                                                    (16*4) = 64 #br#3 LSB (16*3) = 48
                                                                                    #br#2 LSB (16*2) = 32 #br#1 LSB
                                                                                    (16*1) = 16 #br#0 LSB (16*0) = 0
                                                                                    #br#-1 LSB (16*(-1)) = 240 #br#:
                                                                                    #br#: #br#-7LSB(16*(-7)) = 144 */

/* HSADC_ADCCONFIG Bits */
/* HSADC_ADCCONFIG[CONFIG] Bits */
#define HSADC_ADCCONFIG_CONFIG_OFS               (0)                             /* !< CONFIG Offset */
#define HSADC_ADCCONFIG_CONFIG_MASK              ((uint32_t)0xFFFFFFFFU)         /* !< ADC Configuration. This bit field
                                                                                    is used for TI internal
                                                                                    testing/debugging. */

/* HSADC_ADCPPB1CONFIG Bits */
/* HSADC_ADCPPB1CONFIG[CBCEN] Bits */
#define HSADC_ADCPPB1CONFIG_CBCEN_OFS            (5)                             /* !< CBCEN Offset */
#define HSADC_ADCPPB1CONFIG_CBCEN_MASK           ((uint32_t)0x00000020U)         /* !< ADC Post Processing Block Cycle By
                                                                                    Cycle Enable. When set, this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit to automatically
                                                                                    clear the ADCEVTSTAT on a conversion
                                                                                    if the event condition is no longer
                                                                                    present. */

/* HSADC_ADCPPB1CONFIG[CBCEN] Bits */
#define HSADC_ADCPPB1CONFIG_TWOSCOMPEN_OFS       (7)                             /* !< TWOSCOMPEN Offset */
#define HSADC_ADCPPB1CONFIG_TWOSCOMPEN_MASK      ((uint32_t)0x00000080U)         /* !< ADC Post Processing Block 1 Two's
                                                                                    Complement Enable. When set this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit that performs a
                                                                                    two's complement on the output of the
                                                                                    offset/reference subtraction unit
                                                                                    before storing the result in the
                                                                                    ADCPPB1RESULT register. */

/* HSADC_ADCPPB1OFFCAL Bits */
/* HSADC_ADCPPB1OFFCAL[OFFCAL] Bits */
#define HSADC_ADCPPB1OFFCAL_OFFCAL_OFS           (0)                             /* !< OFFCAL Offset */
#define HSADC_ADCPPB1OFFCAL_OFFCAL_MASK          ((uint32_t)0x0000003FU)         /* !< ADC Post Processing Block 1 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to digitally remove any system
                                                                                    level offset inherent in the ADCIN
                                                                                    circuit. This 6-bit signed value is
                                                                                    subtracted from the ADC output before
                                                                                    being stored in the ADCRESULT
                                                                                    register. #br# #br#  00h  No change.
                                                                                    The ADC output is stored directly
                                                                                    into ADCRESULT. #br#  01h  ADC output
                                                                                    - 1 is stored into ADCRESULT. #br#
                                                                                    02h  ADC output - 2 is stored into
                                                                                    ADCRESULT. #br#  ... #br#  20h  ADC
                                                                                    output + 32 is stored into ADCRESULT.
                                                                                    #br#  ... #br#  3Fh  ADC output + 1
                                                                                    is stored into ADCRESULT. #br#
                                                                                    #br#NOTE: The subtraction will
                                                                                    saturate at 0000h and 0FFFh before
                                                                                    being stored into the ADCRESULT
                                                                                    register. #br# #br#Note: in the case
                                                                                    that multiple PPBs point to the same
                                                                                    SOC, only the OFFCAL of the lowest
                                                                                    numbered PPB will be applied. */

/* HSADC_ADCPPB1OFFREF Bits */
/* HSADC_ADCPPB1OFFREF[OFFREF] Bits */
#define HSADC_ADCPPB1OFFREF_OFFREF_OFS           (0)                             /* !< OFFREF Offset */
#define HSADC_ADCPPB1OFFREF_OFFREF_MASK          ((uint32_t)0x00000FFFU)         /* !< ADC Post Processing Block 1 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to either calculate the feedback
                                                                                    error or convert a unipolar signal to
                                                                                    bipolar by subtracting a reference
                                                                                    value. This 12-bit unsigned value is
                                                                                    subtracted from the ADCRESULT
                                                                                    register before being passed through
                                                                                    an optional two's complement function
                                                                                    and stored in the ADCPPB1RESULT
                                                                                    register. This subtraction is not
                                                                                    saturated. #br# #br#  0000h  No
                                                                                    change. The ADCRESULT value is passed
                                                                                    on. #br#  001h  ADCRESULT - 1 is
                                                                                    passed on. #br#  002h  ADCRESULT - 2
                                                                                    is passed on. #br#  ... #br#  800h
                                                                                    ADCRESULT - 2048 is passed on. #br#
                                                                                    ... #br#  FFFh  ADCRESULT - 4096 is
                                                                                    passed on. */

/* HSADC_ADCPPB1TRIPHI Bits */
/* HSADC_ADCPPB1TRIPHI[LIMITHI] Bits */
#define HSADC_ADCPPB1TRIPHI_LIMITHI_OFS          (0)                             /* !< LIMITHI Offset */
#define HSADC_ADCPPB1TRIPHI_LIMITHI_MASK         ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 1 Trip
                                                                                    High Limit. This value sets the
                                                                                    digital comparator trip high limit.
                                                                                    #br# #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPHI[15:13] will be ignored */

/* HSADC_ADCPPB1TRIPLO Bits */
/* HSADC_ADCPPB1TRIPLO[LIMITLO] Bits */
#define HSADC_ADCPPB1TRIPLO_LIMITLO_OFS          (0)                             /* !< LIMITLO Offset */
#define HSADC_ADCPPB1TRIPLO_LIMITLO_MASK         ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 1 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB1TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

