TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB2CONFIG Bits */
/* HSADC_ADCPPB2CONFIG[CBCEN] Bits */
#define HSADC_ADCPPB2CONFIG_CBCEN_OFS            (5)                             /* !< CBCEN Offset */
#define HSADC_ADCPPB2CONFIG_CBCEN_MASK           ((uint32_t)0x00000020U)         /* !< ADC Post Processing Block Cycle By
                                                                                    Cycle Enable. When set, this bit
                                                                                    enables the post conversion hardware
                                                                                    processing circuit to automatically
                                                                                    clear the ADCEVTSTAT on a conversion
                                                                                    if the event condition is no longer
                                                                                    present. */

/* HSADC_ADCPPB2OFFCAL Bits */
/* HSADC_ADCPPB2OFFCAL[OFFCAL] Bits */
#define HSADC_ADCPPB2OFFCAL_OFFCAL_OFS           (0)                             /* !< OFFCAL Offset */
#define HSADC_ADCPPB2OFFCAL_OFFCAL_MASK          ((uint32_t)0x0000003FU)         /* !< ADC Post Processing Block 2 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to digitally remove any system
                                                                                    level offset inherent in the ADCIN
                                                                                    circuit. This 6-bit signed value is
                                                                                    subtracted from the ADC output before
                                                                                    being stored in the ADCRESULT
                                                                                    register. #br# #br#  00h  No change.
                                                                                    The ADC output is stored directly
                                                                                    into ADCRESULT. #br#  01h  ADC output
                                                                                    - 1 is stored into ADCRESULT. #br#
                                                                                    02h  ADC output - 2 is stored into
                                                                                    ADCRESULT. #br#  ... #br#  20h  ADC
                                                                                    output + 32 is stored into ADCRESULT.
                                                                                    #br#  ... #br#  3Fh  ADC output + 1
                                                                                    is stored into ADCRESULT. #br#
                                                                                    #br#NOTE: The subtraction will
                                                                                    saturate at 0000h and 0FFFh before
                                                                                    being stored into the ADCRESULT
                                                                                    register. #br# #br#Note: in the case
                                                                                    that multiple PPBs point to the same
                                                                                    SOC, only the OFFCAL of the lowest
                                                                                    numbered PPB will be applied. */

/* HSADC_ADCPPB2OFFREF Bits */
/* HSADC_ADCPPB2OFFREF[OFFREF] Bits */
#define HSADC_ADCPPB2OFFREF_OFFREF_OFS           (0)                             /* !< OFFREF Offset */
#define HSADC_ADCPPB2OFFREF_OFFREF_MASK          ((uint32_t)0x00000FFFU)         /* !< ADC Post Processing Block 2 Offset
                                                                                    Correction. This bit field can be
                                                                                    used to either calculate the feedback
                                                                                    error or convert a unipolar signal to
                                                                                    bipolar by subtracting a reference
                                                                                    value. This 12-bit unsigned value is
                                                                                    subtracted from the ADCRESULT
                                                                                    register before being passed through
                                                                                    an optional two's complement function
                                                                                    and stored in the ADCPPB2RESULT
                                                                                    register. This subtraction is not
                                                                                    saturated. #br# #br#  0000h  No
                                                                                    change. The ADCRESULT value is passed
                                                                                    on. #br#  001h  ADCRESULT - 1 is
                                                                                    passed on. #br#  002h  ADCRESULT - 2
                                                                                    is passed on. #br#  ... #br#  800h
                                                                                    ADCRESULT - 2048 is passed on. #br#
                                                                                    ... #br#  FFFh  ADCRESULT - 4096 is
                                                                                    passed on. */

/* HSADC_ADCPPB2TRIPHI Bits */
/* HSADC_ADCPPB2TRIPHI[LIMITHI] Bits */
#define HSADC_ADCPPB2TRIPHI_LIMITHI_OFS          (0)                             /* !< LIMITHI Offset */
#define HSADC_ADCPPB2TRIPHI_LIMITHI_MASK         ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 2 Trip
                                                                                    High Limit. This value sets the
                                                                                    digital comparator trip high limit.
                                                                                    #br# #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPHI[15:13] will be ignored */

/* HSADC_ADCPPB2TRIPLO Bits */
/* HSADC_ADCPPB2TRIPLO[LIMITLO] Bits */
#define HSADC_ADCPPB2TRIPLO_LIMITLO_OFS          (0)                             /* !< LIMITLO Offset */
#define HSADC_ADCPPB2TRIPLO_LIMITLO_MASK         ((uint32_t)0x0000FFFFU)         /* !< ADC Post Processing Block 2 Trip
                                                                                    High Low Limit. This value sets the
                                                                                    digital comparator trip low limit if
                                                                                    ADCPPB2TRIPLO.LIMITLO2EN = 1.  #br#
                                                                                    #br#When comparing to an
                                                                                    ADCPPBxRESULT register, the upper
                                                                                    bits will be ignored: #br#-
                                                                                    TRIPLO[15:13] will be ignored in 12
                                                                                    bit mode */

