TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCINTCYCLE Bits */
/* HSADC_ADCINTCYCLE[DELAY] Bits */
#define HSADC_ADCINTCYCLE_DELAY_OFS              (0)                             /* !< DELAY Offset */
#define HSADC_ADCINTCYCLE_DELAY_MASK             ((uint32_t)0x0000003FU)         /* !< ADC Early Interrupt Generation
                                                                                    Cycle Delay: Defines the delay from
                                                                                    the fall edge of ADCSOC in terms of
                                                                                    system clock cycles, for the
                                                                                    interrupt to be generated. */

/* HSADC_ADCINLTRIM1 Bits */
/* HSADC_ADCINLTRIM1[INLTRIM31TO0] Bits */
#define HSADC_ADCINLTRIM1_INLTRIM31TO0_OFS       (0)                             /* !< INLTRIM31TO0 Offset */
#define HSADC_ADCINLTRIM1_INLTRIM31TO0_MASK      ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 31-0. #br#
                                                                                    #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM2 Bits */
/* HSADC_ADCINLTRIM2[INLTRIM63TO32] Bits */
#define HSADC_ADCINLTRIM2_INLTRIM63TO32_OFS      (0)                             /* !< INLTRIM63TO32 Offset */
#define HSADC_ADCINLTRIM2_INLTRIM63TO32_MASK     ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 63-32.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM3 Bits */
/* HSADC_ADCINLTRIM3[INLTRIM95TO64] Bits */
#define HSADC_ADCINLTRIM3_INLTRIM95TO64_OFS      (0)                             /* !< INLTRIM95TO64 Offset */
#define HSADC_ADCINLTRIM3_INLTRIM95TO64_MASK     ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 95-64.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM4 Bits */
/* HSADC_ADCINLTRIM4[INLTRIM127TO96] Bits */
#define HSADC_ADCINLTRIM4_INLTRIM127TO96_OFS     (0)                             /* !< INLTRIM127TO96 Offset */
#define HSADC_ADCINLTRIM4_INLTRIM127TO96_MASK    ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 127-96.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCINLTRIM5 Bits */
/* HSADC_ADCINLTRIM5[INLTRIM159TO128] Bits */
#define HSADC_ADCINLTRIM5_INLTRIM159TO128_OFS    (0)                             /* !< INLTRIM159TO128 Offset */
#define HSADC_ADCINLTRIM5_INLTRIM159TO128_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 159-128.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

