TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCINLTRIM6 Bits */
/* HSADC_ADCINLTRIM6[INLTRIM191TO160] Bits */
#define HSADC_ADCINLTRIM6_INLTRIM191TO160_OFS    (0)                             /* !< INLTRIM191TO160 Offset */
#define HSADC_ADCINLTRIM6_INLTRIM191TO160_MASK   ((uint32_t)0xFFFFFFFFU)         /* !< ADC Linearity Trim Bits 191-160.
                                                                                    #br# #br#This register should not be
                                                                                    modified unless specifically
                                                                                    indicated by TI Errata or other
                                                                                    documentation.  Modifying the
                                                                                    contents of this register could cause
                                                                                    this module to operate outside of
                                                                                    datasheet specifications. */

/* HSADC_ADCREV2 Bits */
/* HSADC_ADCREV2[WRAPPERTYPE] Bits */
#define HSADC_ADCREV2_WRAPPERTYPE_OFS            (0)                             /* !< WRAPPERTYPE Offset */
#define HSADC_ADCREV2_WRAPPERTYPE_MASK           ((uint32_t)0x000000FFU)         /* !< ADC Wrapper Type. Always set to 6
                                                                                    for this ADC. */
/* HSADC_ADCREV2[WRAPPERREV] Bits */
#define HSADC_ADCREV2_WRAPPERREV_OFS             (8)                             /* !< WRAPPERREV Offset */
#define HSADC_ADCREV2_WRAPPERREV_MASK            ((uint32_t)0xFFFFFF00U)         /* !< ADC Revision. To allow
                                                                                    documentation of differences between
                                                                                    revisions. First version is labeled
                                                                                    as 00h. */

/* HSADC_ADCINLTRIMCTL Bits */
/* HSADC_ADCINLTRIMCTL[CALIBMODE] Bits */
#define HSADC_ADCINLTRIMCTL_CALIBMODE_OFS        (0)                             /* !< CALIBMODE Offset */
#define HSADC_ADCINLTRIMCTL_CALIBMODE_MASK       ((uint32_t)0x00000001U)         /* !< ADC Linearity Calibration Mode. */
/* HSADC_ADCINLTRIMCTL[CALIBSTEP] Bits */
#define HSADC_ADCINLTRIMCTL_CALIBSTEP_OFS        (1)                             /* !< CALIBSTEP Offset */
#define HSADC_ADCINLTRIMCTL_CALIBSTEP_MASK       ((uint32_t)0x0000003EU)         /* !< ADC Linearity Calibration Step.
                                                                                    Defines which of the 18 steps of
                                                                                    calibration is to be executed. */
/* HSADC_ADCINLTRIMCTL[KEY] Bits */
#define HSADC_ADCINLTRIMCTL_KEY_OFS              (16)                            /* !< KEY Offset */
#define HSADC_ADCINLTRIMCTL_KEY_MASK             ((uint32_t)0xFFFF0000U)         /* !< ADC Linearity Trim Control Write
                                                                                    Key. Any write to this register must
                                                                                    contain the value 0xA5A5 in these bit
                                                                                    locations. If a write request
                                                                                    attempts to load any other value into
                                                                                    these bits, the write for the entire
                                                                                    register is ignored. These bits
                                                                                    always read back a zero. */

/* HSADC_REP1CTL Bits */
/* HSADC_REP1CTL[MODULEBUSY] Bits */
#define HSADC_REP1CTL_MODULEBUSY_OFS             (3)                             /* !< MODULEBUSY Offset */
#define HSADC_REP1CTL_MODULEBUSY_MASK            ((uint32_t)0x00000008U)         /* !< ADC Trigger Repeater 1 Module Busy
                                                                                    indicator.  In oversampling mode:
                                                                                    #br# #br#0 = Repeater 1 is idle and
                                                                                    can accept a new repeated trigger in
                                                                                    oversampling mode #br#1 = Repeater 1
                                                                                    still has repeated triggers remaining
                                                                                    (NCOUNT > 0) or associated SOCs are
                                                                                    still pending (SOCBUSY is 1) #br#
                                                                                    #br#If a new oversampled trigger is
                                                                                    received while the module is still
                                                                                    busy, the TRIGGEROVF bit will be set
                                                                                    and the trigger will be ignored. */
/* HSADC_REP1CTL[TRIGGEROVF] Bits */
#define HSADC_REP1CTL_TRIGGEROVF_OFS             (7)                             /* !< TRIGGEROVF Offset */
#define HSADC_REP1CTL_TRIGGEROVF_MASK            ((uint32_t)0x00000080U)         /* !< ADC Trigger Repeater 1 Oversampled
                                                                                    Trigger Overflow. #br# #br#Indicates
                                                                                    that a trigger was dropped because a
                                                                                    trigger arrived while the repeater
                                                                                    was still generating repeated
                                                                                    oversampled triggers (NCOUNT was not
                                                                                    0 or SOCs associated with Repeater 1
                                                                                    were still pending).   #br#
                                                                                    #br#Writing a 1 will clear this flag.
                                                                                    #br# #br#Note: This flag won't be set
                                                                                    in undersampling mode or when NSEL =
                                                                                    0; if a trigger arrives before the
                                                                                    previous SOCs have completed, the
                                                                                    trigger will be passed and the
                                                                                    overflow flags of the SOCs that were
                                                                                    still pending will be set.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority and the
                                                                                    overflow bit will remain set. */
/* HSADC_REP1CTL[TRIGGER] Bits */
#define HSADC_REP1CTL_TRIGGER_OFS                (8)                             /* !< TRIGGER Offset */
#define HSADC_REP1CTL_TRIGGER_MASK               ((uint32_t)0x00001F00U)         /* !< ADC Trigger Repeater 1 Trigger
                                                                                    Select.  Selects the trigger to
                                                                                    modify via oversampling or
                                                                                    undersampling. #br# #br#  00h
                                                                                    REPTRIG0 - Software only #br#
                                                                                    01h-1FH   Hardware triggers */
/* HSADC_REP1CTL[SYNCINSEL] Bits */
#define HSADC_REP1CTL_SYNCINSEL_OFS              (16)                            /* !< SYNCINSEL Offset */
#define HSADC_REP1CTL_SYNCINSEL_MASK             ((uint32_t)0x00070000U)         /* !< Trigger repeater 1 sync. input
                                                                                    select.  On a sync. event, all
                                                                                    registers in repeater 1 are reset to
                                                                                    a ready and waiting state.  Values of
                                                                                    NSEL, PHASE, and MODE are preserved.
                                                                                    #br# #br#Note: SOCs associated with
                                                                                    repeater 1 are not cleared.   #br#
                                                                                    #br#0h = Disable Syncin to Repeater 1
                                                                                    #br#1h  - 1Fh  = Hardware syncin
                                                                                    sources */
/* HSADC_REP1CTL[SWSYNC] Bits */
#define HSADC_REP1CTL_SWSYNC_OFS                 (23)                            /* !< SWSYNC Offset */
#define HSADC_REP1CTL_SWSYNC_MASK                ((uint32_t)0x00800000U)         /* !< Trigger repeater 1 software force
                                                                                    sync.  On a sync. event, all
                                                                                    registers in repeater 1 are reset to
                                                                                    a ready and waiting state.  Values of
                                                                                    NSEL, PHASE, and MODE are preserved.
                                                                                    #br# #br#Note: SOCs associated with
                                                                                    repeater 1 are not cleared. */

