TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_REP1N Bits */
/* HSADC_REP1N[NSEL] Bits */
#define HSADC_REP1N_NSEL_OFS                     (0)                             /* !< NSEL Offset */
#define HSADC_REP1N_NSEL_MASK                    ((uint32_t)0x00000003U)         /* !< ADC Trigger Repeater 1 selection of
                                                                                    number of triggers. #br# #br#In
                                                                                    oversampling mode, selects the number
                                                                                    of repeated triggers. For each
                                                                                    trigger received corresponding to
                                                                                    REP1CTL.TRIGSEL, 2^NSEL triggers will
                                                                                    be generated.   #br# #br#0 = 1
                                                                                    trigger is generated (pass-through)
                                                                                    #br#1 = 2 triggers are generated
                                                                                    #br#2 = 4 triggers are generated
                                                                                    #br#3 = 8 triggers are generated
                                                                                    #br# #br#In undersampling mode,
                                                                                    selects the number triggers to be
                                                                                    supressed. 1 out NSEL + 1 triggers
                                                                                    received corresponding to
                                                                                    REP1CTL.TRIGSEL will be passed
                                                                                    through (the first trigger will be
                                                                                    passed through and the subsequent
                                                                                    NSEL triggers will be supressed).
                                                                                    #br# #br#0 = all triggers are passed
                                                                                    #br#1 = 1 out of 2 triggers are
                                                                                    passed #br#2 = 1 out of 3 triggers
                                                                                    are passed #br#... #br#127 = 1 out of
                                                                                    128 triggers are passed */
/* HSADC_REP1N[NCOUNT] Bits */
#define HSADC_REP1N_NCOUNT_OFS                   (16)                            /* !< NCOUNT Offset */
#define HSADC_REP1N_NCOUNT_MASK                  ((uint32_t)0x00070000U)         /* !< ADC trigger repeater 1 trigger
                                                                                    count.   #br# #br#Indicates the
                                                                                    number of triggers remaining to be
                                                                                    generated.  If a trigger is received
                                                                                    corresponding to REP1CTL.TRIGSEL
                                                                                    while NCOUNT is not 0 (the repeater
                                                                                    is still busy generating the repeated
                                                                                    triggers) then the trigger will be
                                                                                    ignored and REP1CTL.TRIGOVF will be
                                                                                    set to 1. */

/* HSADC_REP1FRC Bits */
/* HSADC_REP1FRC[SWFRC] Bits */
#define HSADC_REP1FRC_SWFRC_OFS                  (0)                             /* !< SWFRC Offset */
#define HSADC_REP1FRC_SWFRC_MASK                 ((uint32_t)0x00000001U)         /* !< Write 1 to force a trigger to
                                                                                    repeat block 1 input regardless of
                                                                                    the value of TRIGGER. #br# #br#Always
                                                                                    reads 0. */

/* HSADC_REP2CTL Bits */
/* HSADC_REP2CTL[MODULEBUSY] Bits */
#define HSADC_REP2CTL_MODULEBUSY_OFS             (3)                             /* !< MODULEBUSY Offset */
#define HSADC_REP2CTL_MODULEBUSY_MASK            ((uint32_t)0x00000008U)         /* !< ADC Trigger Repeater 2 Module Busy
                                                                                    indicator.  In oversampling mode:
                                                                                    #br# #br#0 = Repeater 2 is idle and
                                                                                    can accept a new repeated trigger in
                                                                                    oversampling mode #br#1 = Repeater 2
                                                                                    still has repeated triggers remaining
                                                                                    (NCOUNT > 0) or associated SOCs are
                                                                                    still pending (SOCBUSY is 1) #br#
                                                                                    #br#If a new oversampled trigger is
                                                                                    received while the module is still
                                                                                    busy, the TRIGGEROVF bit will be set
                                                                                    and the trigger will be ignored. */
/* HSADC_REP2CTL[TRIGGEROVF] Bits */
#define HSADC_REP2CTL_TRIGGEROVF_OFS             (7)                             /* !< TRIGGEROVF Offset */
#define HSADC_REP2CTL_TRIGGEROVF_MASK            ((uint32_t)0x00000080U)         /* !< ADC Trigger Repeater 2 Oversampled
                                                                                    Trigger Overflow. #br# #br#Indicates
                                                                                    that a trigger was dropped because a
                                                                                    trigger arrived while the repeater
                                                                                    was still generating repeated
                                                                                    oversampled triggers (NCOUNT was not
                                                                                    0 or SOCs associated with Repeater 2
                                                                                    were still pending).   #br#
                                                                                    #br#Writing a 1 will clear this flag.
                                                                                    #br# #br#Note: This flag won't be set
                                                                                    in undersampling mode or when NSEL =
                                                                                    0; if a trigger arrives before the
                                                                                    previous SOCs have completed, the
                                                                                    trigger will be passed and the
                                                                                    overflow flags of the SOCs that were
                                                                                    still pending will be set.  #br#
                                                                                    #br#Note: If software sets the clear
                                                                                    bit on the same cycle that hardware
                                                                                    is trying to set the flag bit, then
                                                                                    hardware has priority and the
                                                                                    overflow bit will remain set. */
/* HSADC_REP2CTL[TRIGGER] Bits */
#define HSADC_REP2CTL_TRIGGER_OFS                (8)                             /* !< TRIGGER Offset */
#define HSADC_REP2CTL_TRIGGER_MASK               ((uint32_t)0x00001F00U)         /* !< ADC Trigger Repeater 2 Trigger
                                                                                    Select.  Selects the trigger to
                                                                                    modify via oversampling or
                                                                                    undersampling. #br# #br#  00h
                                                                                    REPTRIG0 - Software only #br#
                                                                                    01h-1FH   Hardware triggers */
/* HSADC_REP2CTL[SYNCINSEL] Bits */
#define HSADC_REP2CTL_SYNCINSEL_OFS              (16)                            /* !< SYNCINSEL Offset */
#define HSADC_REP2CTL_SYNCINSEL_MASK             ((uint32_t)0x00070000U)         /* !< Trigger repeater 2 sync. input
                                                                                    select.  On a sync. event, all
                                                                                    registers in repeater 2 are reset to
                                                                                    a ready and waiting state.  Values of
                                                                                    NSEL, PHASE, and MODE are preserved.
                                                                                    #br# #br#Note: SOCs associated with
                                                                                    repeater 2 are not cleared.   #br#
                                                                                    #br#0h = Disable Syncin to Repeater 2
                                                                                    #br#1h  - 1Fh  = Hardware syncin
                                                                                    sources */
/* HSADC_REP2CTL[SWSYNC] Bits */
#define HSADC_REP2CTL_SWSYNC_OFS                 (23)                            /* !< SWSYNC Offset */
#define HSADC_REP2CTL_SWSYNC_MASK                ((uint32_t)0x00800000U)         /* !< Trigger repeater 2 software force
                                                                                    sync.  On a sync. event, all
                                                                                    registers in repeater 2 are reset to
                                                                                    a ready and waiting state.  Values of
                                                                                    NSEL, PHASE, and MODE are preserved.
                                                                                    #br# #br#Note: SOCs associated with
                                                                                    repeater 2 are not cleared. */

/* HSADC_REP2N Bits */
/* HSADC_REP2N[NSEL] Bits */
#define HSADC_REP2N_NSEL_OFS                     (0)                             /* !< NSEL Offset */
#define HSADC_REP2N_NSEL_MASK                    ((uint32_t)0x00000003U)         /* !< ADC Trigger Repeater 2 selection of
                                                                                    number of triggers. #br# #br#In
                                                                                    oversampling mode, selects the number
                                                                                    of repeated triggers. For each
                                                                                    trigger received corresponding to
                                                                                    REP2CTL.TRIGSEL, 2^NSEL triggers will
                                                                                    be generated.   #br# #br#0 = 1
                                                                                    trigger is generated (pass-through)
                                                                                    #br#1 = 2 triggers are generated
                                                                                    #br#2 = 4 triggers are generated
                                                                                    #br#3 = 8 triggers are generated
                                                                                    #br# #br#In undersampling mode,
                                                                                    selects the number triggers to be
                                                                                    supressed. 1 out NSEL + 1 triggers
                                                                                    received corresponding to
                                                                                    REP2CTL.TRIGSEL will be passed
                                                                                    through (the first trigger will be
                                                                                    passed through and the subsequent
                                                                                    NSEL triggers will be supressed).
                                                                                    #br# #br#0 = all triggers are passed
                                                                                    #br#1 = 1 out of 2 triggers are
                                                                                    passed #br#2 = 1 out of 3 triggers
                                                                                    are passed #br#... #br#127 = 1 out of
                                                                                    128 triggers are passed */
/* HSADC_REP2N[NCOUNT] Bits */
#define HSADC_REP2N_NCOUNT_OFS                   (16)                            /* !< NCOUNT Offset */
#define HSADC_REP2N_NCOUNT_MASK                  ((uint32_t)0x00070000U)         /* !< ADC trigger repeater 2 trigger
                                                                                    count.   #br# #br#Indicates the
                                                                                    number of triggers remaining to be
                                                                                    generated.  If a trigger is received
                                                                                    corresponding to REP2CTL.TRIGSEL
                                                                                    while NCOUNT is not 0 (the repeater
                                                                                    is still busy generating the repeated
                                                                                    triggers) then the trigger will be
                                                                                    ignored and REP2CTL.TRIGOVF will be
                                                                                    set to 1. */

/* HSADC_REP2FRC Bits */
/* HSADC_REP2FRC[SWFRC] Bits */
#define HSADC_REP2FRC_SWFRC_OFS                  (0)                             /* !< SWFRC Offset */
#define HSADC_REP2FRC_SWFRC_MASK                 ((uint32_t)0x00000001U)         /* !< Write 1 to force a trigger to
                                                                                    repeat block 2 input regardless of
                                                                                    the value of TRIGGER. #br# #br#Always
                                                                                    reads 0. */

/* HSADC_ADCPPB1LIMIT Bits */
/* HSADC_ADCPPB1LIMIT[LIMIT] Bits */
#define HSADC_ADCPPB1LIMIT_LIMIT_OFS             (0)                             /* !< LIMIT Offset */
#define HSADC_ADCPPB1LIMIT_LIMIT_MASK            ((uint32_t)0x00000003U)         /* !< Post Processing Block 1
                                                                                    Oversampling Limit.  Defines the
                                                                                    number of conversions to accumulate
                                                                                    before PSUM is automatically loaded
                                                                                    into SUM.   #br# #br#0 = No -
                                                                                    accumulation #br#1 = 2 conversions
                                                                                    are accumulated #br#2 = 4 conversions
                                                                                    are accumulated #br#3 = 8 conversions
                                                                                    are accumulated  #br# */

/* HSADC_ADCPPB1PCOUNT Bits */
/* HSADC_ADCPPB1PCOUNT[PCOUNT] Bits */
#define HSADC_ADCPPB1PCOUNT_PCOUNT_OFS           (0)                             /* !< PCOUNT Offset */
#define HSADC_ADCPPB1PCOUNT_PCOUNT_MASK          ((uint32_t)0x00000007U)         /* !< Post Processing Block 1
                                                                                    Oversampling Partial Count.  Each
                                                                                    time a new result propagates through
                                                                                    the PPB signal chain and accumulates
                                                                                    into ADCPPB1PSUM this register is
                                                                                    incremented by 1.   #br# #br#This
                                                                                    register is reset when either a
                                                                                    count-match event occurs (PCOUNT =
                                                                                    LIMIT) or PPB1 receives a sync.
                                                                                    event. #br# #br#This result is
                                                                                    available 1 SYSCLK cycle after the
                                                                                    associated ADCPPB1RESULT is
                                                                                    available. This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC (refer to the
                                                                                    ADCPPB1RESULT timing information). */

