TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB1CONFIG2 Bits */
/* HSADC_ADCPPB1CONFIG2[SHIFT] Bits */
#define HSADC_ADCPPB1CONFIG2_SHIFT_OFS           (0)                             /* !< SHIFT Offset */
#define HSADC_ADCPPB1CONFIG2_SHIFT_MASK          ((uint32_t)0x00000007U)         /* !< Post Processing Block 1 right
                                                                                    shift.  Defines the number of bits to
                                                                                    right shift PSUM before loading into
                                                                                    the final SUM.   #br# #br#0 : no
                                                                                    right shift #br#1 : SUM = PSUM >> 1
                                                                                    #br#2 : SUM = PSUM >> 2 #br#... #br#7
                                                                                    : SUM = PSUM >> 7 */
/* HSADC_ADCPPB1CONFIG2[SYNCINSEL] Bits */
#define HSADC_ADCPPB1CONFIG2_SYNCINSEL_OFS       (4)                             /* !< SYNCINSEL Offset */
#define HSADC_ADCPPB1CONFIG2_SYNCINSEL_MASK      ((uint32_t)0x00000070U)         /* !< PPB 1 sync. input select.  On a
                                                                                    sync. event, all partial registers
                                                                                    transfer to the final registers and
                                                                                    are then reset.   #br#Refer to SOC
                                                                                    spec for details */
/* HSADC_ADCPPB1CONFIG2[SWSYNC] Bits */
#define HSADC_ADCPPB1CONFIG2_SWSYNC_OFS          (11)                            /* !< SWSYNC Offset */
#define HSADC_ADCPPB1CONFIG2_SWSYNC_MASK         ((uint32_t)0x00000800U)         /* !< PPB 1 software force sync.  On a
                                                                                    sync. event, all partial registers
                                                                                    transfer to the final registers and
                                                                                    are then reset.  #br# #br#Note: In
                                                                                    the case where the software force
                                                                                    occurs at the same time that a new
                                                                                    sample is added to the PSUM and the
                                                                                    PSUM is being used for a high or low
                                                                                    limit compare, then the comparison
                                                                                    will not occur. */
/* HSADC_ADCPPB1CONFIG2[COMPSEL] Bits */
#define HSADC_ADCPPB1CONFIG2_COMPSEL_OFS         (15)                            /* !< COMPSEL Offset */
#define HSADC_ADCPPB1CONFIG2_COMPSEL_MASK        ((uint32_t)0x00008000U)         /* !< Post Processing Block 1 Compare
                                                                                    Source Select.  This field determines
                                                                                    whether ADCPPB1RESULT or ADCPPB1SUM
                                                                                    is used for the threshold compare.
                                                                                    #br# #br#0 = ADCPPB1RESULT is used
                                                                                    for compare logic #br#1 = ADCPPB1SUM
                                                                                    is used for compare logic */

/* HSADC_ADCPPB1PSUM Bits */
/* HSADC_ADCPPB1PSUM[PSUM] Bits */
#define HSADC_ADCPPB1PSUM_PSUM_OFS               (0)                             /* !< PSUM Offset */
#define HSADC_ADCPPB1PSUM_PSUM_MASK              ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 1
                                                                                    Oversampling Partial Sum.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB1RESULT the result is
                                                                                    subsequently accumulated into this
                                                                                    register.   #br# #br#This register is
                                                                                    reset when either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB1
                                                                                    receives a sync. event. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB1RESULT is
                                                                                    available.  This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC.  In the case
                                                                                    of multiple PPBs associated with the
                                                                                    same SOC, the lowest numbered PPB's
                                                                                    result will be availble 2 SYSCLK
                                                                                    cycle after the associated ADCRESULT
                                                                                    and subsequent results (in order from
                                                                                    lowest numbered PPB to highest) will
                                                                                    each become available every 2-3
                                                                                    SYSCLK cycles (refer to the TRM for
                                                                                    detailed timing information). */
/* HSADC_ADCPPB1PSUM[SIGN] Bits */
#define HSADC_ADCPPB1PSUM_SIGN_OFS               (16)                            /* !< SIGN Offset */
#define HSADC_ADCPPB1PSUM_SIGN_MASK              ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC_ADCPPB2LIMIT Bits */
/* HSADC_ADCPPB2LIMIT[LIMIT] Bits */
#define HSADC_ADCPPB2LIMIT_LIMIT_OFS             (0)                             /* !< LIMIT Offset */
#define HSADC_ADCPPB2LIMIT_LIMIT_MASK            ((uint32_t)0x00000003U)         /* !< Post Processing Block 2
                                                                                    Oversampling Limit.  Defines the
                                                                                    number of conversions to accumulate
                                                                                    before PSUM is automatically loaded
                                                                                    into SUM.   #br# #br#0 = No -
                                                                                    accumulation #br#1 = 2 conversions
                                                                                    are accumulated #br#2 = 4 conversions
                                                                                    are accumulated #br#3 = 8 conversions
                                                                                    are accumulated  #br# */

