TrustedFirmware-M/trusted-firmware-m/platform/ext/target/ti/LP_MSPM33C321A/Native_Driver/ti/devices/msp/peripherals/hw_hsadc.h
/* HSADC_ADCPPB4PSUM Bits */
/* HSADC_ADCPPB4PSUM[PSUM] Bits */
#define HSADC_ADCPPB4PSUM_PSUM_OFS               (0)                             /* !< PSUM Offset */
#define HSADC_ADCPPB4PSUM_PSUM_MASK              ((uint32_t)0x0000FFFFU)         /* !< Post Processing Block 4
                                                                                    Oversampling Partial Sum.  Each time
                                                                                    a new result propagates through the
                                                                                    PPB signal chain and latches into
                                                                                    ADCPPB4RESULT the result is
                                                                                    subsequently accumulated into this
                                                                                    register.   #br# #br#This register is
                                                                                    reset when either a count-match event
                                                                                    occurs (PCOUNT = LIMIT) or PPB4
                                                                                    receives a sync. event. #br# #br#This
                                                                                    result is available 1 SYSCLK cycle
                                                                                    after the associated ADCPPB4RESULT is
                                                                                    available.  This will be 2 SYSCLK
                                                                                    cycles after the associated ADCRESULT
                                                                                    is available, unless multiple PPBs
                                                                                    point to the same SOC.  In the case
                                                                                    of multiple PPBs associated with the
                                                                                    same SOC, the lowest numbered PPB's
                                                                                    result will be availble 2 SYSCLK
                                                                                    cycle after the associated ADCRESULT
                                                                                    and subsequent results (in order from
                                                                                    lowest numbered PPB to highest) will
                                                                                    each become available every 2-3
                                                                                    SYSCLK cycles (refer to the TRM for
                                                                                    detailed timing information). */
/* HSADC_ADCPPB4PSUM[SIGN] Bits */
#define HSADC_ADCPPB4PSUM_SIGN_OFS               (16)                            /* !< SIGN Offset */
#define HSADC_ADCPPB4PSUM_SIGN_MASK              ((uint32_t)0xFFFF0000U)         /* !< Sign Extended Bits. These bits
                                                                                    reflect the same value as bit 15. */

/* HSADC_DTB Bits */

/* HSADC_ADCSEQCTL Bits */
/* HSADC_ADCSEQCTL[SEQEND] Bits */
#define HSADC_ADCSEQCTL_SEQEND_OFS               (0)                             /* !< SEQEND Offset */
#define HSADC_ADCSEQCTL_SEQEND_MASK              ((uint32_t)0x0000000FU)         /* !< END SOC of last enabled sequence */
/* HSADC_ADCSEQCTL[SEQPREEMPT] Bits */
#define HSADC_ADCSEQCTL_SEQPREEMPT_OFS           (16)                            /* !< SEQPREEMPT Offset */
#define HSADC_ADCSEQCTL_SEQPREEMPT_MASK          ((uint32_t)0x00030000U)         /* !< SoC Sequence PREEMPT #br#0X:
                                                                                    Pre-empt disabled #br#10: Pre-empt
                                                                                    enabled and will not restart aborted
                                                                                    Sequence #br#11: Pre-empt enabled and
                                                                                    will restart aborted Sequence */

/* HSADC_ADCSEQ1CONFIG Bits */
/* HSADC_ADCSEQ1CONFIG[ACQPS] Bits */
#define HSADC_ADCSEQ1CONFIG_ACQPS_OFS            (0)                             /* !< ACQPS Offset */
#define HSADC_ADCSEQ1CONFIG_ACQPS_MASK           ((uint32_t)0x000000FFU)         /* !< SOC1 Acquisition Prescale. Controls
                                                                                    the sample and hold window for each
                                                                                    SOC in this Seqeunce. The configured
                                                                                    acquisition time must be at least as
                                                                                    long as one ADCCLK cycle for correct
                                                                                    ADC operation.  The device datasheet
                                                                                    will also specify a minimum sample
                                                                                    and hold window duration. #br#S+H
                                                                                    window values is defined based on a
                                                                                    combonation of ACQPS[7:6]  and
                                                                                    ACQPS[5:0] values #br#If ACQPS[7:6]
                                                                                    value is #br#  "00" S+H window =
                                                                                    ACQPS[5:0] + 1 sysclk cycles #br#
                                                                                    "01"  S+H window = 64 + ((ACQPS[5:0]
                                                                                    +1) * 2) sysclk cycles #br#  "10"
                                                                                    S+H window = 192 + ((ACQPS[5:0] +1) *
                                                                                    4) sysclk cycles #br#  "11"  S+H
                                                                                    window = 448 + ((ACQPS[5:0] +1) * 16)
                                                                                    sysclk cycles */
/* HSADC_ADCSEQ1CONFIG[SAMPCAPRESETDISABLE] Bits */
#define HSADC_ADCSEQ1CONFIG_SAMPCAPRESETDISABLE_OFS (9)                             /* !< SAMPCAPRESETDISABLE Offset */
#define HSADC_ADCSEQ1CONFIG_SAMPCAPRESETDISABLE_MASK ((uint32_t)0x00000200U)         /* !< SOC1 Sample Cap Reset enable :
                                                                                    Resets sample cap after conversion.
                                                                                    #br#0 - The sample cap is reset after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is not reset after each
                                                                                    conversion */
/* HSADC_ADCSEQ1CONFIG[SAMPCAPRESETSEL] Bits */
#define HSADC_ADCSEQ1CONFIG_SAMPCAPRESETSEL_OFS  (10)                            /* !< SAMPCAPRESETSEL Offset */
#define HSADC_ADCSEQ1CONFIG_SAMPCAPRESETSEL_MASK ((uint32_t)0x00000400U)         /* !< SOC1 Sample Cap Reset Select :
                                                                                    Resets sample cap after conversion to
                                                                                    either vrefhi/2 or vreflo #br#0 - The
                                                                                    sample cap is reset to Vreflo after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is reset to Vrefhi/2 after each
                                                                                    conversion */
/* HSADC_ADCSEQ1CONFIG[SEQSTART] Bits */
#define HSADC_ADCSEQ1CONFIG_SEQSTART_OFS         (15)                            /* !< SEQSTART Offset */
#define HSADC_ADCSEQ1CONFIG_SEQSTART_MASK        ((uint32_t)0x00078000U)         /* !< Beginning SOC of SEQ1 */
/* HSADC_ADCSEQ1CONFIG[TRIGSEL] Bits */
#define HSADC_ADCSEQ1CONFIG_TRIGSEL_OFS          (20)                            /* !< TRIGSEL Offset */
#define HSADC_ADCSEQ1CONFIG_TRIGSEL_MASK         ((uint32_t)0x00700000U)         /* !< SOC1 Trigger Source Select. Along
                                                                                    with the SOC1 field in the
                                                                                    ADCINTSOCSEL1 register, this bit
                                                                                    field configures which trigger will
                                                                                    set the SOC1 flag in the ADCSOCFLG1
                                                                                    register to initiate a conversion to
                                                                                    start once priority is given to it.
                                                                                    #br# #br#Note: SOCFRC1 register can
                                                                                    always be used to software trigger
                                                                                    SOCs in addition to any hardware
                                                                                    trigger configuration. #br#  0h
                                                                                    ADCTRIG0 - Software only #br#  1h -
                                                                                    7h  Hardware triggers */
/* HSADC_ADCSEQ1CONFIG[SEQSWFRC] Bits */
#define HSADC_ADCSEQ1CONFIG_SEQSWFRC_OFS         (30)                            /* !< SEQSWFRC Offset */
#define HSADC_ADCSEQ1CONFIG_SEQSWFRC_MASK        ((uint32_t)0x40000000U)         /* !< Write 1 to force a trigger to
                                                                                    Sequencer 1 regardless of the value
                                                                                    of Hardware TRIGGER. #br# #br#Always
                                                                                    reads 0. */
/* HSADC_ADCSEQ1CONFIG[SEQENABLE] Bits */
#define HSADC_ADCSEQ1CONFIG_SEQENABLE_OFS        (31)                            /* !< SEQENABLE Offset */
#define HSADC_ADCSEQ1CONFIG_SEQENABLE_MASK       ((uint32_t)0x80000000U)         /* !< SEQ1Enable #br#Indicates whether
                                                                                    the Sequence1 is enabled or not */

/* HSADC_ADCSEQ2CONFIG Bits */
/* HSADC_ADCSEQ2CONFIG[ACQPS] Bits */
#define HSADC_ADCSEQ2CONFIG_ACQPS_OFS            (0)                             /* !< ACQPS Offset */
#define HSADC_ADCSEQ2CONFIG_ACQPS_MASK           ((uint32_t)0x000000FFU)         /* !< SOC2 Acquisition Prescale. Controls
                                                                                    the sample and hold window for each
                                                                                    SOC in this Seqeunce. The configured
                                                                                    acquisition time must be at least as
                                                                                    long as one ADCCLK cycle for correct
                                                                                    ADC operation.  The device datasheet
                                                                                    will also specify a minimum sample
                                                                                    and hold window duration. #br#S+H
                                                                                    window values is defined based on a
                                                                                    combonation of ACQPS[7:6]  and
                                                                                    ACQPS[5:0] values #br#If ACQPS[7:6]
                                                                                    value is #br#  "00" S+H window =
                                                                                    ACQPS[5:0] + 1 sysclk cycles #br#
                                                                                    "01"  S+H window = 64 + ((ACQPS[5:0]
                                                                                    +1) * 2) sysclk cycles #br#  "10"
                                                                                    S+H window = 192 + ((ACQPS[5:0] +1) *
                                                                                    4) sysclk cycles #br#  "11"  S+H
                                                                                    window = 448 + ((ACQPS[5:0] +1) * 16)
                                                                                    sysclk cycles */
/* HSADC_ADCSEQ2CONFIG[SAMPCAPRESETDISABLE] Bits */
#define HSADC_ADCSEQ2CONFIG_SAMPCAPRESETDISABLE_OFS (9)                             /* !< SAMPCAPRESETDISABLE Offset */
#define HSADC_ADCSEQ2CONFIG_SAMPCAPRESETDISABLE_MASK ((uint32_t)0x00000200U)         /* !< SOC2 Sample Cap Reset enable :
                                                                                    Resets sample cap after conversion.
                                                                                    #br#0 - The sample cap is reset after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is not reset after each
                                                                                    conversion */
/* HSADC_ADCSEQ2CONFIG[SAMPCAPRESETSEL] Bits */
#define HSADC_ADCSEQ2CONFIG_SAMPCAPRESETSEL_OFS  (10)                            /* !< SAMPCAPRESETSEL Offset */
#define HSADC_ADCSEQ2CONFIG_SAMPCAPRESETSEL_MASK ((uint32_t)0x00000400U)         /* !< SOC2 Sample Cap Reset Select :
                                                                                    Resets sample cap after conversion to
                                                                                    either vrefhi/2 or vreflo #br#0 - The
                                                                                    sample cap is reset to Vreflo after
                                                                                    each conversion #br#1 - The sample
                                                                                    cap is reset to Vrefhi/2 after each
                                                                                    conversion */
/* HSADC_ADCSEQ2CONFIG[SEQSTART] Bits */
#define HSADC_ADCSEQ2CONFIG_SEQSTART_OFS         (15)                            /* !< SEQSTART Offset */
#define HSADC_ADCSEQ2CONFIG_SEQSTART_MASK        ((uint32_t)0x00078000U)         /* !< Beginning SOC of SEQ2 */
/* HSADC_ADCSEQ2CONFIG[TRIGSEL] Bits */
#define HSADC_ADCSEQ2CONFIG_TRIGSEL_OFS          (20)                            /* !< TRIGSEL Offset */
#define HSADC_ADCSEQ2CONFIG_TRIGSEL_MASK         ((uint32_t)0x00700000U)         /* !< SOC2 Trigger Source Select. Along
                                                                                    with the SOC2 field in the
                                                                                    ADCINTSOCSEL1 register, this bit
                                                                                    field configures which trigger will
                                                                                    set the SOC2 flag in the ADCSOCFLG1
                                                                                    register to initiate a conversion to
                                                                                    start once priority is given to it.
                                                                                    #br# #br#Note: SOCFRC1 register can
                                                                                    always be used to software trigger
                                                                                    SOCs in addition to any hardware
                                                                                    trigger configuration. #br#  0h
                                                                                    ADCTRIG0 - Software only #br#  1h -
                                                                                    7h  Hardware triggers */
/* HSADC_ADCSEQ2CONFIG[SEQSWFRC] Bits */
#define HSADC_ADCSEQ2CONFIG_SEQSWFRC_OFS         (30)                            /* !< SEQSWFRC Offset */
#define HSADC_ADCSEQ2CONFIG_SEQSWFRC_MASK        ((uint32_t)0x40000000U)         /* !< Write 1 to force a trigger to
                                                                                    Sequencer 2 regardless of the value
                                                                                    of Hardware TRIGGER. #br# #br#Always
                                                                                    reads 0. */
/* HSADC_ADCSEQ2CONFIG[SEQENABLE] Bits */
#define HSADC_ADCSEQ2CONFIG_SEQENABLE_OFS        (31)                            /* !< SEQENABLE Offset */
#define HSADC_ADCSEQ2CONFIG_SEQENABLE_MASK       ((uint32_t)0x80000000U)         /* !< SEQ2Enable #br#Indicates whether
                                                                                    the Sequence2 is enabled or not */

